{"comics": [{"publisher": "IDW PUBLISHING", "description": "The Boddy Mansion is piled in bodies. Still, the candlestick lurks, and may illuminate the unseen killer... or last victim. In the climactic issue of this whodunit, we finally see who'd done it! Cartoonist auteur Dash Shaw takes his last turn in the puzzling, quirky and colorful world of Clue! From the creative mind that brought you the animated movie, My Entire High School Sinking Into the Sea! Visionary creator Dash Shaw re-imagines the world of Clue in this suspense-filled murder mystery! Each extra-length issue also features playable Clue cards based on the comic!", "title": "CLUE CANDLESTICK #3 CVR A SHAW", "price": "$4.99", "creators": "(W) Dash Shaw (A/CA) Dash Shaw", "release_date": "2019-07-24", "diamond_id": "MAY190582"}, {"publisher": "BOOM! STUDIOS", "description": "The Winters family has suffered multiple casualties, but in a world where death is no longer final, could there be life left for those afflicted?", "title": "BONE PARISH #11 (OF 12)", "price": "$3.99", "creators": "(W) Cullen Bunn (A/CA) Jonas Scharf", "release_date": "2019-07-24", "diamond_id": "MAY191235"}, {"publisher": "BOOM! STUDIOS", "description": "Having lost their magical, portal-spotting spyglass (borrowed from Bear-Woman, natch), April, Jo, Ripley, Molly and Mal are stuck in the Land of Lost Things for the foreseeable future! Surrounded by dinos and other dangerous critters and with the snow piling up around them, Mal is beating herself up for getting them in this mess in the first place... but can she come up with a plan to redeem herself, and get them all back home to summertime and the (relative) safety of the Lumberjanes Camp?", "title": "LUMBERJANES #64 CVR A MAIN LEYH", "price": "$3.99", "creators": "(W) Shannon Watters, Kat Leyh (A) AnneMarie Rogers (CA) Kat Leyh", "release_date": "2019-07-24", "diamond_id": "MAY191249"}, {"publisher": "BOOM! STUDIOS", "description": "In the aftermath of the time shenanigans set off by Jo's Mysterious Time Thingy, the Roanoke scouts are a little bit uneasy on their feet. It's up to Counselor Jen to rally the  'Janes, and to help them get back up and off adventuring again, she fs got just the thing: a quest to seek out the most mysterious mythological monster of all  - the mighty JACKALOPE! This New York Times bestseller and multiple Eisner and GLAAD Award-winning series features danger, adventure, and life-long friendships. Get in on the fun with this brand-new adventure written by Shannon Watters and Kat Leyh (Super Cakes) and illustrated by Ayme Sotuyo. Collects issues #45-48.", "title": "LUMBERJANES TP VOL 12", "price": "$14.99", "creators": "(W) Shannon Watters, Kat Leyh (A) Ayme Sotuyo (CA) Kat Leyh", "release_date": "2019-07-24", "diamond_id": "MAR191301"}, {"publisher": "BOOM! STUDIOS", "description": "NECESSARY EVIL, the Power Rangers comic book event of 2019, continues here! You think you know everything about the Mighty Morphin Power Rangers - but this issue answers one of the biggest questions in franchise history with revelations that will shake the team to their core. The White Ranger may be their new leader... but who is the new enemy of the Power Rangers?", "title": "MIGHTY MORPHIN POWER RANGERS #41 CVR A MAIN CAMPBELL", "price": "$3.99", "creators": "(W) Ryan Parrott (A) Daniele Di Nicuolo (CA) Jamal Campbell", "release_date": "2019-07-24", "diamond_id": "MAY191219"}, {"publisher": "BOOM! STUDIOS", "description": "BOOM! Studios presents the the third and final of the Sons of Anarchy Legacy Editions! Collecting the previously released Sons of Anarchy comic for the first time under one cover in an all-new value priced format that no fan can afford to miss.  The ride begins here. Jax Teller has always had one dream: to follow the family legacy and join the Sons of Anarchy. But at eighteen, still reeling from his father's death and just starting out as a prospect, Jax is about to discover just how hard the life of an outlaw can be. Collects Sons of Anarchy Redwood Original #1-12.", "title": "SONS OF ANARCHY LEGACY ED TP VOL 03", "price": "$29.99", "creators": "(W) Ollie Masters (A) Various (CA) Robert Sammelin", "release_date": "2019-07-24", "diamond_id": "MAR191291"}, {"publisher": "DARK HORSE COMICS", "description": "Following the events of Aliens: Resistance, Alec Brand, the colonist rescued by Amanda Ripley and Zula Hendricks, has grown up into an elite Colonial Marine. A secret mission brings him back to the alien-infested moon where he was rescued . . . and face to face with the past. o Written by Brian Wood of Aliens: Defiance and Aliens: Resistance. o Find out the fate of Amanda Ripley after Aliens: Resistance. o Zula Hendricks and Alec Brand return!", "title": "ALIENS RESCUE #1 CVR A DE LA TORRE", "price": "$3.99", "creators": "(W) Brian Wood (A) Kieran McKeown, JL Straw (CA) Roberto De La Torre", "release_date": "2019-07-24", "diamond_id": "MAR190274"}, {"publisher": "DARK HORSE COMICS", "description": "Following the events of Aliens: Resistance, Alec Brand, the colonist rescued by Amanda Ripley and Zula Hendricks, has grown up into an elite Colonial Marine. A secret mission brings him back to the alien-infested moon where he was rescued . . . and face to face with the past. o Written by Brian Wood of Aliens: Defiance and Aliens: Resistance. o Find out the fate of Amanda Ripley after Aliens: Resistance. o Zula Hendricks and Alec Brand return!", "title": "ALIENS RESCUE #1 CVR B CHATER", "price": "$3.99", "creators": "(W) Brian Wood (A) Kieran McKeown, JL Straw (CA) Mack Chater", "release_date": "2019-07-24", "diamond_id": "MAR190275"}, {"publisher": "DARK HORSE COMICS", "description": "From the creator of Oreimo! Elf Yamada seeks political asylum-from her editor-at the Izumi residence, offering in return to spill the secrets of how to turn one's light novel into an anime TV series, an offer certainly of great appeal to the much-less-selling Masamune! Meanwhile, Megumi's vow to make friends with the one girl in her class she hasn't yet, Sagiri, leads her into an embarrassing yet artistically insightful gesture with Eromanga Sensei . . .", "title": "EROMANGA SENSEI TP VOL 03", "price": "$11.99", "creators": "(W) Tsukasa Fushimi (A/CA) Rin", "release_date": "2019-07-24", "diamond_id": "MAR190377"}, {"publisher": "DARK HORSE COMICS", "description": "While her sisters were blessed at birth with exceptional skills, Princess Basil's \"gift\" is to be ordinary.   After escaping an unconventional kidnapping, Princess Basil finds herself far from her castle and must take fate into her own hands. She tracks down the fairy godmother who \"blessed\" her, and finds the solution to her ordinariness might be as simple as finding a magic ring. With an unlikely ally in tow, she takes on gnomes, a badger, and a couple of snarky foxes in her quest for a less ordinary life.   o All-ages reading fun.   o From the co-creator of Lifeformed: Cleo Makes Contact.", "title": "EXTRAORDINARY TP STORY OF ORDINARY PRINCESS", "price": "$12.99", "creators": "(W) Cassie Anderson (A/CA) Cassie Anderson", "release_date": "2019-07-24", "diamond_id": "MAR190336"}, {"publisher": "DARK HORSE COMICS", "description": "The next chapter of the highly acclaimed, Eisner-nominated horror fantasy in a deluxe oversized hardcover format. While Emmy has been focused on dealing with supernatural threats from the outside world, a much bigger problem has been brewing at home. Collects volumes five and six of Harrow County in a deluxe oversized hardcover format with a new cover, sketchbook material, essays, \"Tales from Harrow County\" bonus stories by guest creators, and more!", "title": "HARROW COUNTY LIBRARY EDITION HC VOL 03", "price": "$39.99", "creators": "(W) Cullen Bunn (A) Carla Speed McNeil (A/CA) Tyler Crook", "release_date": "2019-07-24", "diamond_id": "MAR190299"}, {"publisher": "DARK HORSE COMICS", "description": "The thrilling conclusion of the first arc! At the height of a mega-battle against Lux's formidable ship, Grix manages to out-maneuver their opponent despite the Sundog's less-than-battle-ready defenses. Will Vess and Grix ultimately get the help they need from Duni? And when faced the unsettling truth, will the public be with them . . . or against them?", "title": "INVISIBLE KINGDOM #5 (MR)", "price": "$3.99", "creators": "(W) G. Willow Wilson (A/CA) Christian Ward", "release_date": "2019-07-24", "diamond_id": "MAY190253"}, {"publisher": "DARK HORSE COMICS", "description": "Jody Houser and Gabriel Guzm&#225;n continue the tale of StarCraft: Scavengers! After surviving a murderous dark templar's rampage, a terran space engineer named Caleb is forced to do the protoss's bidding: infiltrating a munitions factory in the Umojan Protectorate to find a mysterious source of power. This official expansion of the StarCraft universe in comics is based on an original story by Jody Houser and Blizzard Entertainment's StarCraft game team!", "title": "STARCRAFT SURVIVORS #1 (OF 4)", "price": "$3.99", "creators": "(W) Jody Houser (A/CA) Gabriel Guzman", "release_date": "2019-07-24", "diamond_id": "MAY190268"}, {"publisher": "DARK HORSE COMICS", "description": "The perfect introduction to the post-pandemic world of Ubisoft's record-breaking video-game series, this graphic novel follows Division agent Caleb Dunne from New York City to Washington, D.C. in pursuit of the mysterious woman who murdered his partner. This prequel to Tom Clancy's The Division 2 is a must-have for fans of intrigue and tales of survival. Collects Tom Clancy's The Division: Extremis Malis #1-#3.", "title": "TOM CLANCYS DIVISION HC EXTREMIS MALIS", "price": "$14.99", "creators": "(W) Christofer Emgard (A) Fernando Baldo (CA) JP Leon", "release_date": "2019-07-24", "diamond_id": "MAR190318"}, {"publisher": "DARK HORSE COMICS", "description": "Collected in a softcover omnibus for the very first time, and with over 450 pages of material, this is a must-have for all Tomb Raider fans! This collection fully compiles issues #1-#18 of Dark Horse's 2014 Tomb Raider series, as well as a bonus prequel issue to Crystal Dynamics' highly successful 2013 reboot of the franchise, Tomb Raider: The Beginning.", "title": "TOMB RAIDER OMNIBUS TP VOL 01", "price": "$29.99", "creators": "(W) Gail Simone, Rhianna Pratchett (A) Derlis Santacruz, Nicolas Daniel Selma, Andrea Mutti, Juan Gedeon, Pierluigi Baldassini, Andy Owens (CA) Dan Dos Santos", "release_date": "2019-07-24", "diamond_id": "MAR190320"}, {"publisher": "DARK HORSE COMICS", "description": "This is the official adaptation of the original screenplay for Alien 3, written by William Gibson, the award-winning science fiction author of the cyberpunk cult classic Neuromancer. You'll see familiar characters and places-but not all is the same in this horrifying Cold War thriller! Collects William Gibson's Alien 3 #1-5.", "title": "WILLIAM GIBSON ALIEN 3 HC", "price": "$19.99", "creators": "(W) William Gibson, Johnnie Christmas (A) Tamra Bonvillain (A/CA) Johnnie Christmas", "release_date": "2019-07-24", "diamond_id": "MAR190278"}, {"publisher": "DC COMICS", "description": "Metropolis is in total lockdown, and while everyone is busy dealing with the impossible threat of Leviathan's complete takeover, a mysterious antihero called Thorn has decided to wreak havoc on the invisible empire! Witness the return of Rose and Thorn, the most dangerous woman in the DC Universe-and if you've never heard of her, it's only because she is that good. All this, plus a major EVENT LEVIATHAN revelation! But why wasn't it in the main series? Plus, the invisible mafia held a death grip on the Metropolis underworld...until Lex Luthor visits their criminal competition! ", "title": "ACTION COMICS #1013 YOTV THE OFFER", "price": "$3.99", "creators": "(W) Brian Michael Bendis (A) Szymon Kudranski (CA) Jamal Campbell", "release_date": "2019-07-24", "diamond_id": "MAY190373"}, {"publisher": "DC COMICS", "description": "Eager to prove himself as a guardian for the criminals of Gotham City, Killer Moth has set his sights on taking out one of Gotham's finest heroes...Batgirl! Does this insect menace really stand a chance against Batman's smartest ally? Meanwhile, after their daring escape, the Terrible Trio is on the hunt for new ways to cause trouble for Batgirl. Little do they know, Lex Luthor has already beat them to it and is about to bring Batgirl's worst possible nightmare to life! Oracle is back online. And she's angry.", "title": "BATGIRL #37 YOTV THE OFFER", "price": "$3.99", "creators": "(W) Cecil Castellucci (A) Carmine Di Giandomenico (CA) Giuseppe Camuncoli, Cam Smith", "release_date": "2019-07-24", "diamond_id": "MAY190379"}, {"publisher": "DC COMICS", "description": "The strange goings-on in Neo-Gotham continue, and not even Batman is immune. The Dark Knight of Tomorrow needs to stop the Splitt's high-tech heists once and for all, but his opening move will have everyone confused and bewildered. Will Batman save the day...or be the catalyst to lead his city into ruin?", "title": "BATMAN BEYOND #34", "price": "$3.99", "creators": "(W) Dan Jurgens (A) Rick Leonardi, Ande Parks (CA) Chris Samnee", "release_date": "2019-07-24", "diamond_id": "MAY190381"}, {"publisher": "DC COMICS", "description": "The dedication of a new building commemorating a special Wayne family event brings out all of Neo-Gotham's familiar faces, including one who was not on the guest list. The Joker makes his return to Neo-Gotham, and no one is safe! Will he strike at Batman, Robin, Commissioner Barbara Gordon or the original Caped Crusader, Bruce Wayne? Decades after his last fight with the Dark Knight, the Clown Prince of Crime returns home to take his city back once and for all. Collects issues #25-30 and behind-the-scenes content! ", "title": "BATMAN BEYOND TP VOL 05 THE FINAL JOKE", "price": "$16.99", "creators": "(W) Dan Jurgens (A) Brett Booth, Norm Rapmund, Cully Hamner, Evan \"Doc\" Shaner, Marco Santucci (CA) Viktor Kalvachev", "release_date": "2019-07-24", "diamond_id": "APR190527"}, {"publisher": "DC COMICS", "description": "In this explosive sequel to the critically acclaimed blockbuster BATMAN: WHITE KNIGHT from writer/artist Sean Murphy, The Joker recruits Azrael to help him expose a shocking secret from the Wayne family's legacy-and to run Gotham City into the ground! As Batman rushes to protect the city and his loved ones from danger, the mystery of his ancestry unravels, dealing a devastating blow to the Dark Knight. Exciting new villains and unexpected allies will clash in this unforgettable chapter of the White Knight saga-and the truth about the blood they shed will shake Gotham to its core!", "title": "BATMAN CURSE OF THE WHITE KNIGHT #1 (OF 8)", "price": "$4.99", "creators": "(W) Sean Murphy (A/CA) Sean Murphy", "release_date": "2019-07-24", "diamond_id": "MAY190356"}, {"publisher": "DC COMICS", "description": "Tim returns home to find things aren't as he hoped and that magic is not the shortcut he hopes it'll be. Everything comes at a cost, even safety.", "title": "BOOKS OF MAGIC #10 (MR)", "price": "$3.99", "creators": "(W) Kat Howard (A) Tom Fowler, Brian Churilla (CA) Kai Carpenter", "release_date": "2019-07-24", "diamond_id": "MAY190392"}, {"publisher": "DC COMICS", "description": "Legendary comics creator Jack Kirby's mind-boggling imagination is on full display in this massive hardcover that includes tales of super hero adventure, mystery, war, fantasy, science fiction and even kung fu action from the 1970s and 1980s. These stories introduced important characters, including the Demon and OMAC, and this collection features a run of 12 stories of the Losers from OUR FIGHTING FORCES that includes some of Kirby's most personal tales from his own experiences in World War II. Collects stories from IN THE DAYS OF THE MOB #1, SPIRIT WORLD #1, THE DEMON #1-16, THE SANDMAN #1-6, OMAC #1-8, OUR FIGHTING FORCES #151-162, SUPER POWERS #1-5 (1984), SUPER POWERS #1-6 (1985), 1ST ISSUE SPECIAL #1, 5 and 6, DC COMICS PRESENTS #84, RICHARD DRAGON, KUNG FU FIGHTER #3, WEIRD MYSTERY TALES #1-3 and FORBIDDEN TALES OF DARK MANSION #6.", "title": "DC UNIVERSE BRONZE AGE OMNIBUS BY JACK KIRBY HC", "price": "$150.00", "creators": "(W) Jack Kirby, Dennis O'Neil, Joe Simon, Joey Cavaleri, Michael Fleisher, Paul Kupperberg (A) Vince Colletta, D. Bruce Berry, Adrian Gonzales, Others (A/CA) Jack Kirby, Mike Royer", "release_date": "2019-07-24", "diamond_id": "NOV180560"}, {"publisher": "DC COMICS", "description": "The Joker returns to Gotham City! The Joker is through working with the Legion of Doom, and he wants to get back to his roots: giving Batman absolute hell! The Clown Prince of Crime comes back with a bang-and he's not about to take prisoners! As if that weren't enough, Lex Luthor delivers the cure for Mr. Freeze's beloved wife, Nora, freeing her from cryo-stasis at last! But something else is very, very wrong with Nora...", "title": "DETECTIVE COMICS #1008 YOTV THE OFFER", "price": "$3.99", "creators": "(W) Peter J. Tomasi (A/CA) Doug Mahnke, Jaime Mendoza", "release_date": "2019-07-24", "diamond_id": "MAY190402"}, {"publisher": "DC COMICS", "description": "The hunt is on! Miguel and Summer must journey into the Heroverse in pursuit of Mr. Thunderbolt, who has stolen the H-Dial and threatens to destroy it all! But if they wish to survive, Miguel and Summer must discover the secrets of the Operator, the origin of Mr. Thunderbolt and the history of the Heroverse! All the answers you've been waiting for are right here!", "title": "DIAL H FOR HERO #5 (OF 6)", "price": "$3.99", "creators": "(W) Sam Humphries (A) Scott Hanna (A/CA) Joe Quinones", "release_date": "2019-07-24", "diamond_id": "MAY190404"}, {"publisher": "DC COMICS", "description": "\"The Flash Year One\" finale! This oversize anniversary issue marks the end of Barry Allen's journey to become the Flash-but at what cost? The Turtle's final play will challenge our hero in every way possible, and by the end of the battle, a Flash will be born-and a Flash will die! Also in this issue, witness Lex Luthor's offer to Captain Cold, whose icy vengeance waits for the Flash just around the corner...", "title": "FLASH #75 YOTV THE OFFER", "price": "$4.99", "creators": "(W) Joshua Williamson (A) Christian Duce, Scott Kolins (A/CA) Howard Porter", "release_date": "2019-07-24", "diamond_id": "MAY190411"}, {"publisher": "DC COMICS", "description": "Beaten but not broken after a deadly battle with Cyborg Overman, the Freedom Fighters are on the run once more. But who will take these fugitives from the Gestapo in? The American people, that's who. The citizens of Nazi-occupied America are beginning to believe that resistance is possible, and that the dream of freedom can be reborn anew, thanks to the efforts of Uncle Sam's crew. And Sam's got a plan in place to take back the country that fascism stole, starting at the very top...", "title": "FREEDOM FIGHTERS #7 (OF 12)", "price": "$3.99", "creators": "(W) Robert Venditti (A) Bruno Redondo (CA) Eddy Barrows, Eber Ferreira", "release_date": "2019-07-24", "diamond_id": "MAY190416"}, {"publisher": "DC COMICS", "description": "In these stories from HELLBLAZER #239-249, when the war-mage Mako carves a bloody swath through London's occult underworld, John Constantine tries to rally his former allies, despite all the bridges he's burned... Plus, when something goes horribly wrong in a secret room in the Vatican, a priest is forced to turn to Constantine for help. And in a story from HELLBLAZER SPECIAL: LADY CONSTANTINE #1-4, Johanna Constantine, 18th-century ancestor of Hellblazer, lands a job that promises a future of wealth and entitlement-and almost certain death and damnation in the frozen North Sea!", "title": "HELLBLAZER TP VOL 21 THE LAUGHING MAGICIAN (MR)", "price": "$24.99", "creators": "(W) Andy Diggle, Jason Aaron (A) Leonardo Manco, Giuseppe Camuncoli, Stefano Landini, Sean Murphy, Goran Sudzuka (CA) Kai Carpenter", "release_date": "2019-07-24", "diamond_id": "APR190547"}, {"publisher": "DC COMICS", "description": "From her bayou, Erzulie scries upon the mortal realm and sees four human girls open a mysterious and magical journal filled with whispers and rumors that, if they spread, could cause a pandemic unlike any the Earth has seen, with the power to release Sopona, the loa lord of infectious disease and cousin to Erzulie, who is currently banned from the human plane. Meanwhile, a mysterious infection doctors are calling \"Cotard's Delusion\" spreads, trapping countless souls in the Dreaming and leaving their physical bodies yearning for death. Issues #1-6 of the new series from DC Vertigo are collected here, along with THE SANDMAN UNIVERSE SPECIAL #1. MATURE READERS", "title": "HOUSE OF WHISPERS TP VOL 01 THE POWER DIVIDED (MR)", "price": "$16.99", "creators": "(W) Nalo Hopkinson, Neil Gaiman, Dan Watters, Simon Spurrier, Kat Howard (A) Dominike \"Domo\" Stanton, Aneke, Bilquis Evely, Tom Fowler, Max Fiumara, Sebastian Fiumara (CA) Sean Andrew Murray", "release_date": "2019-07-24", "diamond_id": "APR190546"}, {"publisher": "DC COMICS", "description": "Their battle against Doctor Fate may have come to an end, but the Justice League Dark's problems are just beginning when the helmet begins its search for a new host. Meanwhile, what can Lex Luthor offer a magic user like Circe? For one thing, Lex knows a thing or two about monsters. And where Circe can find them.", "title": "JUSTICE LEAGUE DARK #13 YOTV THE OFFER", "price": "$3.99", "creators": "(W) James TynionIV (A) Mick Gray, Mark Buckingham, Daniel Sampere, Juan Albarran (CA) Guillem March", "release_date": "2019-07-24", "diamond_id": "MAY190429"}, {"publisher": "DC COMICS", "description": "Baseball season is in full swing-which means it's time for two favorite teams to meet again on the old diamond. Yes, it's the Looney Tunes versus the Barnyard Dogs-and it's time for \"Bugs Bunny at the Bat\"!", "title": "LOONEY TUNES #250", "price": "$2.99", "creators": "(W) Scott Gross (A) Omar Aranda, Alberto Saichan (A/CA) Scott Gross", "release_date": "2019-07-24", "diamond_id": "MAY190432"}, {"publisher": "DC COMICS", "description": "J'onn and Diane have had a break in the Ashley Addams case! With a fully armed S.W.A.T. team, they head to a pig farm an infamous human-trafficking cartel calls home. They'll lead a raid to find out the truth about what happened to Ashley ,and J'onn will be forced to use the full spectrum of his Martian abilities on Earth for the first time! ", "title": "MARTIAN MANHUNTER #7 (OF 12)", "price": "$3.99", "creators": "(W) Steve Orlando (A/CA) Riley Rossmo", "release_date": "2019-07-24", "diamond_id": "MAY190435"}, {"publisher": "BOOM! STUDIOS", "description": "Having lost their magical, portal-spotting spyglass (borrowed from Bear-Woman, natch), April, Jo, Ripley, Molly and Mal are stuck in the Land of Lost Things for the foreseeable future! Surrounded by dinos and other dangerous critters and with the snow piling up around them, Mal is beating herself up for getting them in this mess in the first place... but can she come up with a plan to redeem herself, and get them all back home to summertime and the (relative) safety of the Lumberjanes Camp?", "title": "LUMBERJANES #64 CVR B PREORDER CHAU VAR", "price": "$3.99", "creators": "(W) Shannon Watters, Kat Leyh (A) AnneMarie Rogers (CA) Chan Chau", "release_date": "2019-07-24", "diamond_id": "MAY191250"}, {"publisher": "BOOM! STUDIOS", "description": "", "title": "MIGHTY MORPHIN POWER RANGERS #41 FOC MORA VAR", "price": "$3.99", "creators": "(W) Ryan Parrott (A) Daniele Di Nicuolo (CA) Dan Mora", "release_date": "2019-07-24", "diamond_id": "MAY198769"}, {"publisher": "BOOM! STUDIOS", "description": "NECESSARY EVIL, the Power Rangers comic book event of 2019, continues here! You think you know everything about the Mighty Morphin Power Rangers - but this issue answers one of the biggest questions in franchise history with revelations that will shake the team to their core. The White Ranger may be their new leader... but who is the new enemy of the Power Rangers?", "title": "MIGHTY MORPHIN POWER RANGERS #41 FOIL MONTES VAR", "price": "$4.99", "creators": "(W) Ryan Parrott (A) Daniele Di Nicuolo (CA) Goni Montes", "release_date": "2019-07-24", "diamond_id": "MAY191221"}, {"publisher": "DARK HORSE COMICS", "description": "From the creator of One-Punch Man!   In a showdown with Black Vinegar Middle School's shadow gang leader, Teru, Mob sticks to his policy of nonviolence and refrains from using his powers-and gets knocked out! The fight seems over for Mob . . . but something then awakens in Mob, beyond the confines of his conscious mind! And in the aftermath, a new story develops with Ritsu, Mob's conflicted younger brother who enjoys the social success Mob desires . . . yet still longs for what Mob has that Ritsu lacks-psychic power!", "title": "MOB PSYCHO 100 TP VOL 03 (MR)", "price": "$11.99", "creators": "(W) One (A/CA) One", "release_date": "2019-07-24", "diamond_id": "FEB190390"}, {"publisher": "DC COMICS", "description": "Metropolis is in total lockdown, and while everyone is busy dealing with the impossible threat of Leviathan's complete takeover, a mysterious antihero called Thorn has decided to wreak havoc on the invisible empire! Witness the return of Rose and Thorn, the most dangerous woman in the DC Universe-and if you've never heard of her, it's only because she is that good. All this, plus a major EVENT LEVIATHAN revelation! But why wasn't it in the main series? Plus, the invisible mafia held a death grip on the Metropolis underworld...until Lex Luthor visits their criminal competition! ", "title": "ACTION COMICS #1013 CARD STOCK VAR ED YOTV THE OFFER", "price": "$4.99", "creators": "(W) Brian Michael Bendis (A) Szymon Kudranski (CA) Frank Quitely", "release_date": "2019-07-24", "diamond_id": "MAY190374"}, {"publisher": "DC COMICS", "description": "Eager to prove himself as a guardian for the criminals of Gotham City, Killer Moth has set his sights on taking out one of Gotham's finest heroes...Batgirl! Does this insect menace really stand a chance against Batman's smartest ally? Meanwhile, after their daring escape, the Terrible Trio is on the hunt for new ways to cause trouble for Batgirl. Little do they know, Lex Luthor has already beat them to it and is about to bring Batgirl's worst possible nightmare to life! Oracle is back online. And she's angry.", "title": "BATGIRL #37 CARD STOCK VAR ED YOTV THE OFFER", "price": "$4.99", "creators": "(W) Cecil Castellucci (A) Carmine Di Giandomenico, Cam Smith (CA) Joshua Middleton", "release_date": "2019-07-24", "diamond_id": "MAY190380"}, {"publisher": "DC COMICS", "description": "The strange goings-on in Neo-Gotham continue, and not even Batman is immune. The Dark Knight of Tomorrow needs to stop the Splitt's high-tech heists once and for all, but his opening move will have everyone confused and bewildered. Will Batman save the day...or be the catalyst to lead his city into ruin?", "title": "BATMAN BEYOND #34 VAR ED", "price": "$3.99", "creators": "(W) Dan Jurgens (A) Rick Leonardi, Ande Parks (CA) Kaare Andrews", "release_date": "2019-07-24", "diamond_id": "MAY190382"}, {"publisher": "DC COMICS", "description": "In this explosive sequel to the critically acclaimed blockbuster BATMAN: WHITE KNIGHT from writer/artist Sean Murphy, The Joker recruits Azrael to help him expose a shocking secret from the Wayne family's legacy-and to run Gotham City into the ground! As Batman rushes to protect the city and his loved ones from danger, the mystery of his ancestry unravels, dealing a devastating blow to the Dark Knight. Exciting new villains and unexpected allies will clash in this unforgettable chapter of the White Knight saga-and the truth about the blood they shed will shake Gotham to its core!", "title": "BATMAN CURSE OF THE WHITE KNIGHT #1 (OF 8) VAR ED", "price": "$4.99", "creators": "(W) Sean Murphy (A/CA) Sean Murphy", "release_date": "2019-07-24", "diamond_id": "MAY190357"}, {"publisher": "DC COMICS", "description": "The Joker returns to Gotham City! The Joker is through working with the Legion of Doom, and he wants to get back to his roots: giving Batman absolute hell! The Clown Prince of Crime comes back with a bang-and he's not about to take prisoners! As if that weren't enough, Lex Luthor delivers the cure for Mr. Freeze's beloved wife, Nora, freeing her from cryo-stasis at last! But something else is very, very wrong with Nora...", "title": "DETECTIVE COMICS #1008 CARD STOCK VAR ED YOTV THE OFFER", "price": "$4.99", "creators": "(W) Peter J. Tomasi (A) Doug Mahnke, Jaime Mendoza (CA) Bryan Hitch", "release_date": "2019-07-24", "diamond_id": "MAY190403"}, {"publisher": "DC COMICS", "description": "\"The Flash Year One\" finale! This oversize anniversary issue marks the end of Barry Allen's journey to become the Flash-but at what cost? The Turtle's final play will challenge our hero in every way possible, and by the end of the battle, a Flash will be born-and a Flash will die! Also in this issue, witness Lex Luthor's offer to Captain Cold, whose icy vengeance waits for the Flash just around the corner...", "title": "FLASH #75 CARD STOCK VAR ED YOTV THE OFFER", "price": "$5.99", "creators": "(W) Joshua Williamson (A) Howard Porter, Christian Duce, Scott Kolins (CA) Francis Manapul", "release_date": "2019-07-24", "diamond_id": "MAY190412"}, {"publisher": "DC COMICS", "description": "Their battle against Doctor Fate may have come to an end, but the Justice League Dark's problems are just beginning when the helmet begins its search for a new host. Meanwhile, what can Lex Luthor offer a magic user like Circe? For one thing, Lex knows a thing or two about monsters. And where Circe can find them.", "title": "JUSTICE LEAGUE DARK #13 CARD STOCK VAR ED YOTV THE OFFER", "price": "$4.99", "creators": "(W) James TynionIV (A) Daniel Sampere, Mark Buckingham (CA) Dan Quintana", "release_date": "2019-07-24", "diamond_id": "MAY190430"}, {"publisher": "DC COMICS", "description": "J'onn and Diane have had a break in the Ashley Addams case! With a fully armed S.W.A.T. team, they head to a pig farm an infamous human-trafficking cartel calls home. They'll lead a raid to find out the truth about what happened to Ashley ,and J'onn will be forced to use the full spectrum of his Martian abilities on Earth for the first time! ", "title": "MARTIAN MANHUNTER #7 (OF 12) VAR ED", "price": "$3.99", "creators": "(W) Steve Orlando (A) Riley Rossmo (CA) Joshua Middleton", "release_date": "2019-07-24", "diamond_id": "MAY190436"}, {"publisher": "DC COMICS", "description": "With his chemical shape-shifting powers, Metamorpho the Element Man is more than a match for pretty much any super-villain...except maybe a huge elemental monster with shape-shifting powers of its own! It's up to the gang to solve the mystery and unmask the monster-once Scooby and Shaggy stop running in terror from both the monster and Metamorpho, that is!", "title": "SCOOBY DOO TEAM UP #49", "price": "$2.99", "creators": "(W) Sholly Fisch (A/CA) Dario Brizuela", "release_date": "2019-07-24", "diamond_id": "MAY190444"}, {"publisher": "DC COMICS", "description": "From the burning world of Krypton to the bucolic fields of Kansas, the first chapter of SUPERMAN YEAR ONE tracks Clark Kent's youth in Kansas, as he comes to terms with his strange powers and struggles to find his place in our world. DC BLACK LABEL is proud to present the definitive origin of Superman as rendered by the legendary comics creators Frank Miller and John Romita Jr.!  PRESTIGE FORMAT  MATURE READERS", "title": "SUPERMAN YEAR ONE #1 (OF 3) 2ND PTG (MR)", "price": "$7.99", "creators": "(W) Frank Miller (A/CA) Danny Miki, John RomitaJr", "release_date": "2019-07-24", "diamond_id": "MAY198771"}, {"publisher": "DC COMICS", "description": "The end of the God Game is upon us-and technology has turned the Terrifics' lives upside down! At long last, the secret origin of the mysterious technological being known as the Keeper is revealed, and this story is actually a tale as old as time. If the Terrifics are to shut the Keeper down and stop his tech infection from spreading worldwide, our heroes will need to do something they never thought they could: stop evolution itself. The Bizarro Terrifics were almost the most dangerous things in the universe. When Lex Luthor gives them a time machine, they become the most dangerous things in the universe. This will get weird.", "title": "TERRIFICS #18 CARD STOCK VAR ED YOTV THE OFFER", "price": "$4.99", "creators": "(W) Gene Luen Yang (A) Stephen Segovia (CA) Ricardo Federici", "release_date": "2019-07-24", "diamond_id": "MAY190455"}, {"publisher": "DC COMICS", "description": "The end of the God Game is upon us-and technology has turned the Terrifics' lives upside down! At long last, the secret origin of the mysterious technological being known as the Keeper is revealed, and this story is actually a tale as old as time. If the Terrifics are to shut the Keeper down and stop his tech infection from spreading worldwide, our heroes will need to do something they never thought they could: stop evolution itself. The Bizarro Terrifics were almost the most dangerous things in the universe. When Lex Luthor gives them a time machine, they become the most dangerous things in the universe. This will get weird.", "title": "TERRIFICS #18 YOTV THE OFFER", "price": "$3.99", "creators": "(W) Gene Luen Yang (A) Stephen Segovia, Ray McCarthy (CA) Dan Mora", "release_date": "2019-07-24", "diamond_id": "MAY190454"}, {"publisher": "DC COMICS", "description": "At last, after years of exile: Wonder Woman returns to Themyscira! But in the wake of Ares' escape from his prison, the island is no longer the paradise she remembers... and the Amazons are no longer a united people! Disaster has forced Hippolyta's warriors to choose a deadly new ally, and Wonder Woman is powerless to convince them to turn back to the light! Who among the Amazons could possibly change the course of history? Only one: Diana's long-lost aunt, Antiope! A major figure of the Wonder Woman mythos returns in this extra-sized anniversary issue!  Plus, Lex Luthor visits fellow Legion of Doom member Cheetah. He comes bearing gifts: a mythical weapon, one rumored to be able to kill anything-even a god. Or, in Wonder Woman's case, a demi-god.", "title": "WONDER WOMAN #75 CARD STOCK VAR ED YOTV THE OFFER", "price": "$5.99", "creators": "(W) G. Willow Wilson (A) Xermanico, Jesus Merino, Vicente Cifuentes (CA) Jenny Frison", "release_date": "2019-07-24", "diamond_id": "MAY190461"}, {"publisher": "DC COMICS", "description": "At last, after years of exile: Wonder Woman returns to Themyscira! But in the wake of Ares' escape from his prison, the island is no longer the paradise she remembers... and the Amazons are no longer a united people! Disaster has forced Hippolyta's warriors to choose a deadly new ally, and Wonder Woman is powerless to convince them to turn back to the light! Who among the Amazons could possibly change the course of history? Only one: Diana's long-lost aunt, Antiope! A major figure of the Wonder Woman mythos returns in this extra-sized anniversary issue!  Plus, Lex Luthor visits fellow Legion of Doom member Cheetah. He comes bearing gifts: a mythical weapon, one rumored to be able to kill anything-even a god. Or, in Wonder Woman's case, a demi-god.", "title": "WONDER WOMAN #75 YOTV THE OFFER", "price": "$4.99", "creators": "(W) C. Willow Wilson (A) Xermanico, Jesus Merino, Vicente Cifuentes (CA) Terry Dodson, Rachel Dodson", "release_date": "2019-07-24", "diamond_id": "MAY190460"}, {"publisher": "IDW PUBLISHING", "description": "Having returned to policing duty on Planet Earth, former Space Sheriff Tracy finds a world markedly changed from the one he left. Feeling handcuffed by expanded legal protections afforded suspects and stricter guidelines of evidence, Tracy all but begs bad guys to shoot first, and he may get his wish, thanks to nemeses such as explosion-crazed Jonny Scorn, the hand grenade-toting revolutionary called El Tigress, and the aptly-named Dope King. These early '70s adventures also see the dauntless detective facing off against one of the strip's best late-era grotesque villains: Pouch, who uses a repulsive hidden flap in his neck to hide anything from stolen diamonds to automatic pistols. Volume 26 reprints all dailies and Sundays from December 24, 1970 to September 27, 1972.  Advance solicited for June release! \"Chester Gould introduced a new hard-hitting type of realism [that] marked a radical and historical departure: the comics were no longer just funny.\"-Jerry Robinson, The Comics", "title": "COMPLETE CHESTER GOULD DICK TRACY HC VOL 26", "price": "$44.99", "creators": "(W) Chester Gould (A/CA) Chester Gould", "release_date": "2019-07-24", "diamond_id": "JAN190750"}, {"publisher": "IDW PUBLISHING", "description": "Donald Duck takes center stage in three hilarious stories never before seen in the U.S.! In \"The Probability Diverter,\" Gyro Gearloose's latest invention changes Donald's luck-but not necessarily for the better! In the second story, Gyro's fix-it machine finds itself in need of some pretty heavy fixing before it can do what it is supposed to! Finally, in \"Satisfaction Guaranteed,\" Donald's bespoke shoe service guarantees customer satisfaction, even if the customer is a criminal trying to make a speedy getaway! It's another fun-filled issue guaranteed to please even the pickiest of fans!", "title": "DISNEY COMICS AND STORIES #6 CVR A MAZZARELLO", "price": "$5.99", "creators": "(W) Pietro B Zemelo, Sio, Enrico Faccini (A) Emanuele Virzi, Enrico Faccini (A/CA) Marco Mazzarello", "release_date": "2019-07-24", "diamond_id": "MAY190613"}, {"publisher": "IDW PUBLISHING", "description": "", "title": "DUNGEONS & DRAGONS A DARKENED WISH #2 (OF 5) CVR B CHARACTER", "price": "$3.99", "creators": "(W) B Dave Walters (A/CA) Tess Fowler", "release_date": "2019-07-24", "diamond_id": "MAR198832"}, {"publisher": "IDW PUBLISHING", "description": "When war threatens the Moonshae Isles, legendary heroes return to defeat the forces of an unthinkable foe. Enter Hoondarrh: the Red Rage of Mintarn, the Sleeping Wyrm of Skadaurak, a Red dragon of legendary size, cunning, and strength. None shall prevail against his might. Creators B. Dave Walters (Stream of Many Eyes, Geek & Sundry, The Rundown) and Tess Fowler (Kid Lobotomy, Critter) join forces to bring you an all-new D&D adventure of epic scope and flair! Dungeons & Dragons 5th Edition sales continue to explode! With millions of copies sold around the world, D&D has returned as a cultural force!", "title": "DUNGEONS & DRAGONS A DARKENED WISH #2 CVR A FOWLER", "price": "$3.99", "creators": "(W) B Dave Walters (A/CA) Tess Fowler", "release_date": "2019-07-24", "diamond_id": "JAN190760"}, {"publisher": "IDW PUBLISHING", "description": "It's the Gorgeous Ladies of Wrestling versus... nuclear war?! Real-life tensions simmering between Russia and America explode into the ring in this spectacular summer issue! Zoya, Liberty Belle, Nuke, Ozone, a cage match, existential dread, and glitter, so much glitter-looks like this Cold War's about to heat up! Devin Grayson (Nightwing) and Lisa Sterle (Submerged) enter the ring in their GLOW debut!", "title": "GLOW SUMMER SPECIAL ONE-SHOT #1 CVR A STERLE", "price": "$3.99", "creators": "(W) Devin Grayson (A/CA) Lisa Sterle", "release_date": "2019-07-24", "diamond_id": "MAY190556"}, {"publisher": "IDW PUBLISHING", "description": "Advance solicited for June release! A new spin on classic action-figure nostalgia bursts off the page in this inventive nod to the titans of golden age comics. They say they're here to help us, but are they here to replace us? A modern sci-fi epic updating the story of the classic 1980s toy line, from the mind that brought you Transformers vs. G.I. Joe and American Barbarian.", "title": "GO BOTS TP VOL 01", "price": "$17.99", "creators": "(W) Tom Scioli (A/CA) Tom Scioli", "release_date": "2019-07-24", "diamond_id": "FEB190694"}, {"publisher": "IDW PUBLISHING", "description": "Guns and revenge. As American as the wicked west. Ricky Toledo is going to find the man that killed her mother, and revenge is going to be sweet. Ricky was 15 when she fell hard for a handsome drifter who rented a room in her family home. Then he killed her mother and got her father sent to prison for it. It's three years later, and Ricky will stop at nothing to get revenge. A broken young woman and her trusty companion-a gold Smith and Wesson 45 named Golddigger-track a serial killer hiding in plain sight as a travel blogger. It's a dark, grimy game of cat and mouse through a tangled American landscape. And, like all the best crime noir, it's a twisted love story.  Advance solicited for June release! From the Eisner Award-winning creators of Stray Bullets.", "title": "LODGER TP VOL 01", "price": "$17.99", "creators": "(W) Maria Lapham, David Lapham (A/CA) David Lapham", "release_date": "2019-07-24", "diamond_id": "FEB190748"}, {"publisher": "IDW PUBLISHING", "description": "Tibalt's attacks on Chandra get more personal-and closer to home-as he thrives on her anguish. Meanwhile, Ajani tries to help her make peace with the events of her past, but will Chandra's outrage be enough to overcome the devilish Planeswalker's empathic onslaught?  Vita Ayala and Harvey Tolibao continue their exploration of one of Magic's most popular-and powerful-characters, pushing her closer to the brink than ever before!  Features a story spinning directly out of January's new Magic card set, Ravnica Allegiance, and the unnamed 2019 set! Fan-favorite villain Tibalt returns, after a long absence from Magic's story.", "title": "MAGIC THE GATHERING CHANDRA #3  OUM", "price": "$3.99", "creators": "(W) Vita Ayala (A) Harvey Tolibao (CA) Siya Oum", "release_date": "2019-07-24", "diamond_id": "NOV180703"}, {"publisher": "IDW PUBLISHING", "description": "Count Nefaria's otherworldly assault reaches its fever pitch as the Avengers struggle to reunite and save Dr. Strange! Can Earth's Mightiest Heroes overcome impossible odds?", "title": "MARVEL ACTION AVENGERS #6 SOMMARIVA", "price": "$3.99", "creators": "(W) Matthew K. Manning (A/CA) Jon Sommariva", "release_date": "2019-07-24", "diamond_id": "MAR190631"}, {"publisher": "IDW PUBLISHING", "description": "A double feature as everybody's favorite rage monster joins forces with the Marvel Universe's biggest heroes! First-Bruce Banner visits the doctor to get control of the Hulk-but Doctor Strange has problems of his own! Then-Hercules needs a helping hand, and that spells T-R-O-U-B-L-E for Hulk, Spider-Man, and Iron Man! Reprinting Marvel Adventures Hulk (2007) #5 and Marvel Adventures Super Heroes (2008) #1!", "title": "MARVEL ACTION CLASSICS HULK #1 CVR A SANTACRUZ", "price": "$4.99", "creators": "(W) Paul Tobin (A) Alvin Lee, David Nakayama (CA) Juan Santacruz, Juan Santacruz", "release_date": "2019-07-24", "diamond_id": "MAY190600"}, {"publisher": "IDW PUBLISHING", "description": "Get ready to roll a natural 20 as Pinkie Pie and the rest of your favorite ponies gear up for a live-action role playing game for the ages! With elaborate costumes, captured princes, and one of Pinkie's famous pies on the line, you can bet things are going to get crazy! Gear up for a fantastic adventure with your favorite ponies! Sam Maggs and Kate Sherron return to My Little Pony!", "title": "MY LITTLE PONY FRIENDSHIP IS MAGIC #80 CVR A SHERRON", "price": "$3.99", "creators": "(W) Sam Maggs (A/CA) Kate Sherron", "release_date": "2019-07-24", "diamond_id": "MAY190620"}, {"publisher": "IDW PUBLISHING", "description": "Get ready to roll a natural 20 as Pinkie Pie and the rest of your favorite ponies gear up for a live-action role playing game for the ages! With elaborate costumes, captured princes, and one of Pinkie's famous pies on the line, you can bet things are going to get crazy! Gear up for a fantastic adventure with your favorite ponies! Sam Maggs and Kate Sherron return to My Little Pony!", "title": "MY LITTLE PONY FRIENDSHIP IS MAGIC #80 CVR B RICHARD", "price": "$3.99", "creators": "(W) Sam Maggs (A) Kate Sherron (CA) Sara Richard", "release_date": "2019-07-24", "diamond_id": "MAY190621"}, {"publisher": "IDW PUBLISHING", "description": "A terrifying noir nightmare in the occult underworld of Las Vegas! In the thrilling conclusion to the series, Chris and Alexis return to a Las Vegas in flames, enlisting the help of some old friends in a final showdown with evil forces-both demonic and all too human. The question is: how will they know who to trust...? From the mind of VJ Boyd, co-executive producer of S.W.A.T. and producer of Justified, comes a fantastic new noir-ish tale!", "title": "NIGHT MOVES #5 (OF 5) BURNHAM", "price": "$3.99", "creators": "(W) V.J. Boyd, Justin Boyd (A) Clay McCormack (CA) Chris Burnham", "release_date": "2019-07-24", "diamond_id": "JAN190849"}, {"publisher": "IDW - TOP SHELF", "description": "Red Panda and Moon Bear are the defenders of their community! Together, these brave siblings rescue lost cats, scold bullies, and solve mysteries, all before Mama and Papa get home. But lately... the mysteries have been EXTRA mysterious. All of RP and MB's powers may not be enough to handle spooks, supervillains, alien invaders, and time warps! It'll take all their imagination-and some new friends-to uncover the secret cause behind all these events before the whole world goes crazy.In his first book for young readers, Cuban-American cartoonist Jarod Rosell  presents a whimsical and tender-hearted adventure, packed with Saturday-morning adventure and glowing with Miami sunshine. Featuring a combination of cartoon action and magical realism, equally inspired by Spy Kids, Junot Diaz, Gravity Falls, and The Powerpuff Girls. Made up of 10 chapter-length adventures that stand alone but weave together into a stunning climax.", "title": "RED PANDA & MOON BEAR TP VOL 01", "price": "$14.99", "creators": "(W) Jarod Rosello (A/CA) Jarod Rosello", "release_date": "2019-07-24", "diamond_id": "DEC180805"}, {"publisher": "IDW PUBLISHING", "description": "\"Crisis City, Part 1\"! Eggman's reign of terror continues! Sonic races to help Team Dark rescue civilians from a major city, but his own metal virus infection is getting worse! Outnumbered, how long can Sonic outrun the inevitable? And who else will fall? A major cornerstone of the metal virus saga! One of Sonic's most powerful allies falls victim to the disease, but who? Cover A by new-to-IDW Sonic artist Ryan Jampole!", "title": "SONIC THE HEDGEHOG #19 CVR A JAMPOLE", "price": "$3.99", "creators": "(W) Ian Flynn (A) Jack Lawrence (CA) Ryan Jampole", "release_date": "2019-07-24", "diamond_id": "MAY190590"}, {"publisher": "IDW PUBLISHING", "description": "\"Crisis City, Part 1\"! Eggman's reign of terror continues! Sonic races to help Team Dark rescue civilians from a major city, but his own metal virus infection is getting worse! Outnumbered, how long can Sonic outrun the inevitable? And who else will fall? A major cornerstone of the metal virus saga! One of Sonic's most powerful allies falls victim to the disease, but who? Cover B by artist Wells Graham!", "title": "SONIC THE HEDGEHOG #19 CVR B WELLS GRAHAM", "price": "$3.99", "creators": "(W) Ian Flynn (A) Jack Lawrence (CA) Lamar Wells, Reggie Graham", "release_date": "2019-07-24", "diamond_id": "MAY190591"}, {"publisher": "IDW PUBLISHING", "description": "Advance solicited for July release! A powerful new foe has set his sights on Angel Island, and Sonic and his friends must defend it at all costs! When Neo Metal Sonic-an evil robot with Sonic's speed, Dr. Eggman's intellect, and an unbreakable mechanical body-conquers the island to grow his power even more, Sonic and his friends must team up and take the fight to him. But even with the full power of the Resistance behind him, will Sonic be able to take down Neo Metal Sonic once and for all? Collects Sonic the Hedgehog issues #9-12.", "title": "SONIC THE HEDGEHOG TP VOL 03 BATTLE FOR ANGEL ISLAND", "price": "$15.99", "creators": "(W) Ian Flynn (A) Tracy Yardley, Evan Stanley (CA) Nathalie Fourdraine", "release_date": "2019-07-24", "diamond_id": "MAR190640"}, {"publisher": "IDW PUBLISHING", "description": "Like many late-21st-century teens, geeky 16-year-old Vess gets packed off to spend her summer at Space Camp-which is literally in space. Tragically, a shuttle accident sends her and the rest of the passengers careening toward a cold, frosty death among the stars. But when a gigantic, space-faring water bear miraculously rescues Vess and her beloved retro Discman, it's the beginning of an extraordinary friendship and an incredible journey home, all set to the nostalgic tunes of Vess's 1990s-heavy playlist. From the mind of New York Times bestseller Delilah S. Dawson (Star Wars: Forces of Destiny, Marvel Action: Spider-Man) comes an inventive story about loss and resiliency. Nostalgia-tinged humor, perfect for fans of Saga and Guardians of the Galaxy. Series covers by totally radical artists Sara Richard, Paulina Ganucheau, Nicoletta Baldari, and Sara Alfageeh!", "title": "STAR PIG #1 (OF 4) CVR A RICHARD", "price": "$3.99", "creators": "(W) Delilah S Dawson (A) Francesco Gaston (CA) Sara Richard", "release_date": "2019-07-24", "diamond_id": "MAY190557"}, {"publisher": "IDW PUBLISHING", "description": "This is it-the grand conclusion of the biggest Star Trek crossover ever. As the god-like beings prepare for the final round of their games, the captains have their own surprise in store for their powerful tormentors-and they're taking it all the way into the Q-Dimension!  The crews of The Next Generation, The Original Series, Voyager, and Deep Space Nine come together to face their biggest challenge yet! Written by Star Trek: TNG: Mirror Broken scribes Scott & David Tipton! The shocking conclusion you won't want to miss!", "title": "STAR TREK Q CONFLICT #6 (OF 6) CVR A MESSINA", "price": "$3.99", "creators": "(W) Scott Tipton, David Tipton (A/CA) David Messina", "release_date": "2019-07-24", "diamond_id": "APR190631"}, {"publisher": "IDW PUBLISHING", "description": "This is it-the grand conclusion of the biggest Star Trek crossover ever. As the god-like beings prepare for the final round of their games, the captains have their own surprise in store for their powerful tormentors-and they're taking it all the way into the Q-Dimension!  The crews of The Next Generation, The Original Series, Voyager, and Deep Space Nine come together to face their biggest challenge yet! Written by Star Trek: TNG: Mirror Broken scribes Scott & David Tipton! The shocking conclusion you won't want to miss!", "title": "STAR TREK Q CONFLICT #6 (OF 6) CVR B MESSINA", "price": "$3.99", "creators": "(W) Scott Tipton, David Tipton (A/CA) David Messina", "release_date": "2019-07-24", "diamond_id": "APR190632"}, {"publisher": "IDW PUBLISHING", "description": "Advance solicited for July release! A galaxy-spanning adventure tracking Han Solo's renowned light freighter in a series of tales highlighting its illustrious history, starring Chewie, Luke, Leia, and more! Follow Bazine Netal's quest for the legendary Millennium Falcon! The First Order spy travels the galaxy seeking information on the ship's whereabouts. Along the way she will hear tales from some familiar faces-and some new ones-hot on the trail of the fastest ship in the galaxy! Collects the \"Flight of the Falcon\" story from Star Wars Adventures #14-18, plus the Flight of the Falcon one-shot.  ", "title": "STAR WARS ADVENTURES TP VOL 06 FLIGHT OF FALCON", "price": "$9.99", "creators": "(W) Michael Moreci (A) Arianna Florean (CA) Philip Murphy", "release_date": "2019-07-24", "diamond_id": "MAR190647"}, {"publisher": "IDW PUBLISHING", "description": "Advance solicited for July release! Rapunzel and her friends are back for more adventures and more heartwarming stories written by fan-favorite Katie Cook! What will Rapunzel, Eugene, Cassandra, and their friends get up to in the kingdom of Corona this time? Find out in six stories you'll read over and over again! Collects Tangled: The Series: Hair-Raising Adventures #1-3.  ", "title": "TANGLED THE SERIES HAIR RAISING ADVENTURES TP", "price": "$9.99", "creators": "(W) Katie Cook (A) Diogo Saito (A/CA) Eduard Petrovich, Rosa La Barbera", "release_date": "2019-07-24", "diamond_id": "MAR190668"}, {"publisher": "IDW PUBLISHING", "description": "A new batch of mutant villains are in town and they've mastered the art of noiseless theft! The TMNT are powerless to stop them until they realize someone close to them shares a history with the bad guys: April O'Neil! Will she be able to overcome a case of stage fright and save the day? An exciting and hilarious adventure with an important message about learning to be comfortable speaking up!", "title": "TMNT RISE OF TMNT SOUND OFF #1 (OF 3) CVR A THOMAS", "price": "$3.99", "creators": "(W) Matthew K. Manning (A/CA) Chad Thomas", "release_date": "2019-07-24", "diamond_id": "MAY190567"}, {"publisher": "IMAGE COMICS", "description": "\"THE HAUNTED GALAXY,\" Part Four (of Five): The hit series continues as readers catch up with the evil vampire witch Mother inside her floating castle on the planet Mata. She's been tipped off that a force for hope has come to free the oppressed people of her galaxy, but she won't give up her power without a star-spanning magical conflagration.", "title": "ASCENDER #4 (MR)", "price": "$3.99", "creators": "(W) Jeff Lemire (A/CA) Dustin Nguyen", "release_date": "2019-07-24", "diamond_id": "MAY190053"}, {"publisher": "IMAGE COMICS", "description": "\"FAIRY TALE ENDING,\" Part Three: We're coming up on the big finale, so we're pulling out all the stops. The magical battles we've seen so far are nothing compared to what we get here, as Sizzajee and his reduced crew of evil wizards battle the powerful Tigers for the fate of the Hole World while Wizord and Ruby Stitch try to save their daughter's life. And speaking of Margaret... what's her deal, really? Let's find out... together!", "title": "CURSE WORDS #23 CVR A BROWNE (MR)", "price": "$3.99", "creators": "(W) Charles Soule (A/CA) Ryan Browne", "release_date": "2019-07-24", "diamond_id": "MAY190061"}, {"publisher": "IMAGE COMICS", "description": "\"FAIRY TALE ENDING,\" Part Three: We're coming up on the big finale, so we're pulling out all the stops. The magical battles we've seen so far are nothing compared to what we get here, as Sizzajee and his reduced crew of evil wizards battle the powerful Tigers for the fate of the Hole World while Wizord and Ruby Stitch try to save their daughter's life. And speaking of Margaret... what's her deal, really? Let's find out... together!", "title": "CURSE WORDS #23 CVR B BROWNE INTERCONNECTED (MR)", "price": "$3.99", "creators": "(W) Charles Soule (A/CA) Ryan Browne", "release_date": "2019-07-24", "diamond_id": "MAY190062"}, {"publisher": "IMAGE COMICS", "description": "END OF STORY ARC! Season Two of FARMHAND draws to a close in game-changing fashion. With Jedidiah gone, only Ezekiel and Andrea stand in the way of Mayor Thorne's diabolical designs for the Farm.", "title": "FARMHAND #10 (MR)", "price": "$3.99", "creators": "(W) Rob Guillory (A/CA) Rob Guillory", "release_date": "2019-07-24", "diamond_id": "MAY190066"}, {"publisher": "IMAGE COMICS", "description": "\"FRACTURE I,\" Part Two: The alliance between Carlyle and D'Souza is nothing more than a trap-and now Forever must face not one, but two Lazari in a desperate battle to the death. And at Sequoia, Marisol finds herself following Eight's footsteps into a snowy night. The secrets are beginning to take their toll, and when they come out, the results will be shattering. All this, plus artifacts from the firm of Trautmann and Howe, another installment of World of Lazarus: Tools of War, and original short fiction by award-winning author ADAM CHRISTOPHER.", "title": "LAZARUS RISEN #2 (MR)", "price": "$7.99", "creators": "(W) Greg Rucka (A/CA) Michael Lark", "release_date": "2019-07-24", "diamond_id": "MAY190081"}, {"publisher": "IMAGE COMICS", "description": "MINISERIES PREMIERE!  Director/screenwriter DARCY VAN POELGEEST boasts a long list of awards and accolades for his storytelling prowess and brings the same writing finesse to IAN BERTRAM's breathtakingly detailed artwork in the gorgeous, hyper-detailed miniseries LITTLE BIRD. With the same limitless scope as a new EAST OF WEST or SAGA and the drama and surrealism of Akira, LITTLE BIRD follows a young resistance fighter who battles against an oppressive American Empire and searches for her own identity in a world on fire.", "title": "LITTLE BIRD #1 (OF 5) 4TH PTG (MR)", "price": "$3.99", "creators": "(W) Darcy Van Poelgeest (A/CA) Ian Bertram", "release_date": "2019-07-24", "diamond_id": "MAY198629"}, {"publisher": "IMAGE COMICS", "description": "Run as he might, Abel's past is catching up to him. He is astounded and relieved, however, when the woodland people he and Fox encounter seem to know his mark.", "title": "MIDDLEWEST #9 (MR)", "price": "$3.99", "creators": "(W) Skottie Young (A/CA) Jorge Corona", "release_date": "2019-07-24", "diamond_id": "MAY190085"}, {"publisher": "IMAGE COMICS", "description": "Perry and Evil come face-to-face in Mexico. No one gets out alive.", "title": "REDNECK #22 (MR)", "price": "$3.99", "creators": "(W) Donny Cates (A/CA) Lisandro Estherren", "release_date": "2019-07-24", "diamond_id": "MAY190094"}, {"publisher": "IMAGE COMICS", "description": "When chaos besieges the kingdom of Arcadia, warrior Amala Citlali uncovers a shocking truth-she's a non-player character in an advanced video game. With her very existence at stake, Amala embarks on a journey across worlds-to escape her prison, find her creator, and demand answers to the fundamental questions of her existence. In his debut editorial role, comics veteran KYLE HIGGINS guides this intimate story of self-discovery that takes readers to lands of high fantasy, futuristic science fiction... and beyond. Collects SELF/MADE #1-6.", "title": "SELF MADE TP (MR)", "price": "$16.99", "creators": "(W) Mat Groom (A/CA) Eduardo Ferigato", "release_date": "2019-07-24", "diamond_id": "MAY190045"}, {"publisher": "IMAGE COMICS", "description": "SERIES FINALE!  \"FIX THE WORLD,\" Conclusion: In the aftermath of war, how does Willa pick up the pieces? How does she deal with this very different status quo? And what the hell does Willa want to do with her life now that her world's completely changed?", "title": "SKYWARD #15", "price": "$3.99", "creators": "(W) Joe Henderson (A/CA) Lee Garbett", "release_date": "2019-07-24", "diamond_id": "MAY190102"}, {"publisher": "IMAGE COMICS", "description": "\"WAR TO 300,\" Part One-TWO ISSUES 'TIL SPAWN #300! Spawn vs. the full might of Heaven's newest Godsend-ROUND 1! TODD McFARLANE and JASON SHAWN ALEXANDER up the ante in this lead-up to SPAWN's record-setting 300th issue, featuring TODD McFARLANE's special parody recreation of one of his own classic comic book covers!", "title": "SPAWN #298 2ND PTG", "price": "$2.99", "creators": "(W) Todd McFarlane (A) Jason Shawn Alexander", "release_date": "2019-07-24", "diamond_id": "MAY198790"}, {"publisher": "IMAGE COMICS", "description": "Introducing Pace and Pickles-an exciting and strange new ally guarding a horrible secret! Nathan, Cross, and the crew of the Disco Queen scour the ruins of Earth for the woman responsible for wiping Nathan's mind, only to find themselves in a fight to the death against mysterious genetic monstrosities... and not everyone makes it out alive. YOU'VE BEEN WARNED!", "title": "WEATHERMAN VOL 2 #2 CVR A FOX (MR)", "price": "$3.99", "creators": "(W) Jody LeHeup (A/CA) Nathan Fox", "release_date": "2019-07-24", "diamond_id": "MAY190113"}, {"publisher": "IMAGE COMICS", "description": "Introducing Pace and Pickles-an exciting and strange new ally guarding a horrible secret! Nathan, Cross, and the crew of the Disco Queen scour the ruins of Earth for the woman responsible for wiping Nathan's mind, only to find themselves in a fight to the death against mysterious genetic monstrosities... and not everyone makes it out alive. YOU'VE BEEN WARNED!", "title": "WEATHERMAN VOL 2 #2 CVR B ROBINSON (MR)", "price": "$3.99", "creators": "(W) Jody LeHeup (A) Nathan Fox (CA) Andrew Robinson", "release_date": "2019-07-24", "diamond_id": "MAY190114"}, {"publisher": "IMAGE COMICS", "description": "Introducing Pace and Pickles-an exciting and strange new ally guarding a horrible secret! Nathan, Cross, and the crew of the Disco Queen scour the ruins of Earth for the woman responsible for wiping Nathan's mind, only to find themselves in a fight to the death against mysterious genetic monstrosities... and not everyone makes it out alive. YOU'VE BEEN WARNED!", "title": "WEATHERMAN VOL 2 #2 CVR C MIGNOLA (MR)", "price": "$3.99", "creators": "(W) Jody LeHeup (A) Nathan Fox (CA) Mike Mignola", "release_date": "2019-07-24", "diamond_id": "MAY198072"}, {"publisher": "IMAGE COMICS", "description": "\"OKAY,\" Part Five: There's one \"i\" in \"decide\" but two in \"deicide.\" I'm not sure if that tells you anything, but it sounds pretty enigmatic, right?", "title": "WICKED & DIVINE #44 CVR A MCKELVIE & WILSON (MR)", "price": "$3.99", "creators": "(W) Kieron Gillen (A/CA) Jamie McKelvie", "release_date": "2019-07-24", "diamond_id": "MAR190257"}, {"publisher": "IMAGE COMICS", "description": "\"OKAY,\" Part Five: There's one \"i\" in \"decide\" but two in \"deicide.\" I'm not sure if that tells you anything, but it sounds pretty enigmatic, right?", "title": "WICKED & DIVINE #44 CVR B RIOS & MUERTO (MR)", "price": "$3.99", "creators": "(W) Kieron Gillen (A) Jamie McKelvie, Matt Wilson (CA) Emma Rios, Miquel Muerto", "release_date": "2019-07-24", "diamond_id": "MAR190258"}, {"publisher": "MARVEL COMICS", "description": "ALL HAIL THE QUEEN OF THE BLACK COAST! B&#202;LIT undergoes a harrowing experience... but will she emerge stronger or forever broken by the ordeal? And: N'Yaga's greatest challenge! PLUS: The conclusion of the all-new B&#202;LIT novella, \"BONE WHISPERS\"! Parental Advisory ", "title": "AGE OF CONAN BELIT #5 (OF 5)", "price": "$3.99", "creators": "(W) Tini Howard (A) Kate Niemczyk (CA) Sana Takeda", "release_date": "2019-07-24", "diamond_id": "MAY190907"}, {"publisher": "MARVEL COMICS", "description": "Boomerang's influence is finally felt, and Spider-Man joins the Superior Foes!  Wait, that's not possible, is it? IS IT?!?! Rated T ", "title": "AMAZING SPIDER-MAN #26", "price": "$3.99", "creators": "(W) Nick Spencer (A) Kev Walker (CA) Ryan Ottley", "release_date": "2019-07-24", "diamond_id": "MAY190825"}, {"publisher": "MARVEL COMICS", "description": "The Maroons strike back! You watched them steal the M'Kraan Shard from the empire. Now the rebels are ready to show who they really are. \"He Who Put the Blade Where It Belonged\" retakes his rightful title, and the Black Panther is reborn! With the Panther once again among their ranks, they're certain of victory - but at what cost? T'Challa faces a creature of nightmare and journeys to the home world of the Between, the place where N'Jadaka's rise began! But what he learns there will lead him to question the rebellion's very foundation. Will Bast's champion ever be fully restored? Learn at last how the king of Wakanda found himself a slave in the Vibranium mines of a half-familiar world as T'Challa's lost past is revealed! Collecting BLACK PANTHER (2018) #7-12. Rated T ", "title": "BLACK PANTHER TP BOOK 07 INTERG EMPIRE WAKANDA PT 02", "price": "$17.99", "creators": "(W) Ta-Nehisi Coates (A) Kev Walker, Jen Bartel (CA) Paolo Rivera", "release_date": "2019-07-24", "diamond_id": "MAY190968"}, {"publisher": "MARVEL COMICS", "description": "The legend of Conan continues! Tired of the thieving life, Conan signs on as a mercenary for the warring kingdom of Turan. The enemy will tell of Conan's legendary skill in battle - if any are left alive - but palace intrigue may prove more dangerous to the barbarian than any foe! After all, it's never wise to bed a wizard's woman... Then, Conan joins Red Sonja for a multipart adventure! Last, but far from least, comes Roy Thomas and Gil Kane's never-before-reprinted adaptation of \"The Hour of the Dragon\" - the iconic story of how Conan became king and conqueror, and met the woman who would become his wife. And it's all restored to the original, authentic coloring! Collecting CONAN THE BARBARIAN (1970) #27-51 and ANNUAL #1; GIANT-SIZE CONAN #1-4 and material from SAVAGE SWORD OF CONAN (1974) #1, #8 and #10. Rated T ", "title": "CONAN THE BARBARIAN ORIGINAL MARVEL YEARS OMNIBUS HC VOL 02", "price": "$125.00", "creators": "(W) Roy Thomas (A) John Buscema, Gil Kane, More (CA) Dale Keown", "release_date": "2019-07-24", "diamond_id": "JAN191082"}, {"publisher": "MARVEL COMICS", "description": "", "title": "DAREDEVIL #7 2ND PTG ZDARSKY VAR", "price": "$3.99", "creators": "(W) Chip Zdarsky (A) Lalit Kumar Sharma (CA) Chip Zdarsky", "release_date": "2019-07-24", "diamond_id": "MAY198635"}, {"publisher": "MARVEL COMICS", "description": "\"HERALD SUPREME\" CONTINUES! The only good thing about Galactus sating his hunger in another dimension was that the Marvel Universe was safe. Well, he's powered up and back in the Marvel Universe and all of space and time is in dreadful danger! Rated T+", "title": "DOCTOR STRANGE #16", "price": "$3.99", "creators": "(W) Mark Waid, Barry Kitson (A) Barry Kitson, Scott Koblish (CA) Jesus Saiz", "release_date": "2019-07-24", "diamond_id": "APR190865"}, {"publisher": "MARVEL COMICS", "description": "\"HERALD SUPREME\" CONTINUES! The only good thing about Galactus sating his hunger in another dimension was that the Marvel Universe was safe. Well, he's powered up and back in the Marvel Universe and all of space and time is in dreadful danger! Rated T+", "title": "DOCTOR STRANGE #16 YARDIN SPIDER-MAN STEALTH SUIT VAR", "price": "$3.99", "creators": "(W) Mark Waid, Barry Kitson (A) Barry Kitson, Scott Koblish (CA) David Yardin", "release_date": "2019-07-24", "diamond_id": "APR190866"}, {"publisher": "MARVEL COMICS", "description": "THE FIERCEST LADIES OF THE MARVEL UNIVERSE - ON AND OFF THE PAGE! Straight off her silver-screen debut, Captain Marvel takes the world by storm! And speaking of the weather, Storm of the X-Men faces a problem only a goddess could solve. Add the Invisible Woman, and you've got an unstoppable trio in a story by Hugo-nominated novelist and SPIDER-GWEN: GHOST-SPIDER writer Seanan McGuire! Then, Leah Williams takes us back to the golden days of romance with Millie the Model! PLUS: Get your dose of herstory with profiles on classic and contemporary creators! Rated T+ ", "title": "FEARLESS #1 (OF 3)", "price": "$4.99", "creators": "(W) Seanan McGuire, Leah Williams, Kelly Thompson (A) Claire Roe, Carmen Nunez Carnero (CA) Yasmin Putri", "release_date": "2019-07-24", "diamond_id": "MAY190735"}, {"publisher": "MARVEL COMICS", "description": "THE FIERCEST LADIES OF THE MARVEL UNIVERSE - ON AND OFF THE PAGE! Straight off her silver-screen debut, Captain Marvel takes the world by storm! And speaking of the weather, Storm of the X-Men faces a problem only a goddess could solve. Add the Invisible Woman, and you've got an unstoppable trio in a story by Hugo-nominated novelist and SPIDER-GWEN: GHOST-SPIDER writer Seanan McGuire! Then, Leah Williams takes us back to the golden days of romance with Millie the Model! PLUS: Get your dose of herstory with profiles on classic and contemporary creators! Rated T+ ", "title": "FEARLESS #1 (OF 3) FRISON CONNECTING VAR", "price": "$4.99", "creators": "(W) Seanan McGuire, Leah Williams, Kelly Thompson (A) Claire Roe, Carmen Nunez Carnero (CA) Jenny Frison", "release_date": "2019-07-24", "diamond_id": "MAY190736"}, {"publisher": "MARVEL COMICS", "description": "", "title": "GUARDIANS OF THE GALAXY #6 2ND PTG SHAW VAR", "price": "$3.99", "creators": "(W) Donny Cates (A/CA) Geoff Shaw", "release_date": "2019-07-24", "diamond_id": "MAY198636"}, {"publisher": "MARVEL COMICS", "description": "\"FAITHLESS\", Part 1: The death of Rocket begins here! In the aftermath of the FINAL GAUNTLET, the Guardians of the Galaxy are taking some well deserved R&R. But their vacation is about to be cut short when a familiar, but radically powerful enemy returns. And what does all of this have to do with the whereabouts of a certain raccoon? Rated T+ ", "title": "GUARDIANS OF THE GALAXY #7", "price": "$3.99", "creators": "(W) Donny Cates (A) Cory Smith (CA) David Marquez", "release_date": "2019-07-24", "diamond_id": "MAY190851"}, {"publisher": "MARVEL COMICS", "description": "\"FAITHLESS\", Part 1: The death of Rocket begins here! In the aftermath of the FINAL GAUNTLET, the Guardians of the Galaxy are taking some well deserved R&R. But their vacation is about to be cut short when a familiar, but radically powerful enemy returns. And what does all of this have to do with the whereabouts of a certain raccoon? Rated T+ ", "title": "GUARDIANS OF THE GALAXY #7 CAMUNCOLI CARNAGE-IZED VAR", "price": "$3.99", "creators": "(W) Donny Cates (A) Cory Smith (CA) Giuseppe Camuncoli", "release_date": "2019-07-24", "diamond_id": "MAY190852"}, {"publisher": "MARVEL COMICS", "description": "ALL-NEW STORY BY LEGENDARY CREATOR MARK WAID! Everything you ever wanted to know about the Marvel Universe - in one lavishly illustrated series! From the Big Bang to the twilight of existence, HISTORY OF THE MARVEL UNIVERSE chronicles completely, for the first time, everything that was, is or will be! Lushly illustrated text tells the complete story of the Marvel Universe, revealing previously unknown secrets and serving as the ultimate reference book for Marvel fans! Witness the greatest tale ever told - and be prepared for some shocking revelations! Rated T ", "title": "HISTORY OF MARVEL UNIVERSE #1 (OF 6)", "price": "$4.99", "creators": "(W) Mark Waid (A) Javier Rodriguez (CA) Steve McNiven", "release_date": "2019-07-24", "diamond_id": "MAY190714"}, {"publisher": "MARVEL COMICS", "description": "ALL-NEW STORY BY LEGENDARY CREATOR MARK WAID! Everything you ever wanted to know about the Marvel Universe - in one lavishly illustrated series! From the Big Bang to the twilight of existence, HISTORY OF THE MARVEL UNIVERSE chronicles completely, for the first time, everything that was, is or will be! Lushly illustrated text tells the complete story of the Marvel Universe, revealing previously unknown secrets and serving as the ultimate reference book for Marvel fans! Witness the greatest tale ever told - and be prepared for some shocking revelations! Rated T ", "title": "HISTORY OF MARVEL UNIVERSE #1 (OF 6) RODRIGUEZ VAR", "price": "$4.99", "creators": "(W) Mark Waid (A/CA) Javier Rodriguez", "release_date": "2019-07-24", "diamond_id": "MAY190715"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6)", "price": "$5.99", "creators": "(W) Jonathan Hickman (A/CA) Pepe Larraz", "release_date": "2019-07-24", "diamond_id": "MAY190690"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6) BLANK VAR", "price": "$5.99", "creators": "(W) Jonathan Hickman (A) Pepe Larraz", "release_date": "2019-07-24", "diamond_id": "MAY190702"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6) BROOKS CONNECTING VAR", "price": "$5.99", "creators": "(W) Jonathan Hickman (A) Pepe Larraz (CA) Mark Brooks", "release_date": "2019-07-24", "diamond_id": "MAY190691"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6) CHARACTER DECADES VAR", "price": "$5.99", "creators": "(W) Jonathan Hickman (A) Pepe Larraz (CA) Marco Checchetto", "release_date": "2019-07-24", "diamond_id": "MAY190695"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6) CHRISTOPHER ACTION VAR", "price": "$5.99", "creators": "(W) Jonathan Hickman (A) Pepe Larraz (CA) John Tyler Christopher", "release_date": "2019-07-24", "diamond_id": "MAY190692"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6) PICHELLI FLOWER VAR", "price": "$5.99", "creators": "(W) Jonathan Hickman (A) Pepe Larraz (CA) Sara Pichelli", "release_date": "2019-07-24", "diamond_id": "MAY190694"}, {"publisher": "MARVEL COMICS", "description": "FACE THE FUTURE! Superstar writer Jonathan Hickman (SECRET WARS, AVENGERS, FANTASTIC FOUR) takes the reins of the X-Men universe! Since the release of Uncanny X-Men #1, there have been four seminal moments in the history of the X-Men. Giant-Sized X-Men. X-Men. Age of Apocalypse. New X-Men. Four iconic series that introduced a new era for Marvel's mutants and revolutionized the X-Men. In House of X, Charles Xavier reveals his master plan for mutantkind...one that will bring mutants out of the shadow of mankind and into the light once more. Rated T+ ", "title": "HOUSE OF X #1 (OF 6) YOUNG VAR", "price": "$5.99", "creators": "(W) Jonathan Hickman (A) Pepe Larraz (CA) Skottie Young", "release_date": "2019-07-24", "diamond_id": "MAY190699"}, {"publisher": "MARVEL COMICS", "description": "An epic story of anger unbound! Exiled by a group of Marvel heroes to the savage alien planet of Sakaar, the Hulk raged, bled and conquered - rising from slave to gladiator to king. Now the Hulk returns to Earth to wreak his terrible vengeance on Iron Man, Reed Richards, Doctor Strange and Black Bolt - and anyone else who gets in the way. Stronger than ever, accompanied by his monstrous Warbound gladiator allies, and possessed by the fiercest and purest rage imaginable, the Hulk may just tear this stupid planet in half. Collecting WORLD WAR HULK #1-5.  Rated T+ ", "title": "HULK TP WORLD WAR HULK NEW PTG", "price": "$24.99", "creators": "(W) Greg Pak (A) John RomitaJr (CA) David Finch", "release_date": "2019-07-24", "diamond_id": "MAY190974"}, {"publisher": "MARVEL COMICS", "description": "Ms. Marvel reaches the explosive finale of her adventure in space and finds her life - and her costume - forever changed! Victory comes at a cost, and when it comes to paying up, Kamala may not have much choice in the matter... PLUS! Kamala gets an AWESOME NEW COSTUME! Rated T+", "title": "MAGNIFICENT MS MARVEL #5", "price": "$3.99", "creators": "(W) Saladin Ahmed (A) Minkyu Jung (CA) Eduard Petrovich", "release_date": "2019-07-24", "diamond_id": "MAY190871"}, {"publisher": "MARVEL COMICS", "description": "", "title": "MAJOR X #4 (OF 6) 2ND PTG LIEFELD VAR", "price": "$3.99", "creators": "(W) Rob Liefeld (A) Brent Peebles, Adelso Corona (CA) Rob Liefeld", "release_date": "2019-07-24", "diamond_id": "MAY198165"}, {"publisher": "MARVEL COMICS", "description": "", "title": "MAJOR X #5 (OF 6) 2ND PTG LIEFELD VAR", "price": "$3.99", "creators": "(W) Rob Liefeld (A) Brent Peeples, Adelso Corona (CA) Rob Liefeld", "release_date": "2019-07-24", "diamond_id": "MAY198637"}, {"publisher": "MARVEL COMICS", "description": "", "title": "MARVEL COMICS PRESENTS #6 2ND PTG FRIGERI VAR", "price": "$4.99", "creators": "(W) Charles Soule, Tim Seeley, Ed Brisson (A) Paulo Siqueira, More (CA) Juan Frigeri", "release_date": "2019-07-24", "diamond_id": "MAY198638"}, {"publisher": "MARVEL COMICS", "description": "Morgan Le Fay is on the verge of turning the tri-state area into the kingdom she's always dreamed of - and Ms. Marvel, Squirrel Girl and their friends are out of ideas to stop her. But sometimes help can come from the most unexpected places - and just when you need it most, you'll find the pathway home is clear after all. Rated T", "title": "MARVEL RISING #5 (OF 5)", "price": "$3.99", "creators": "(W) Nilah Magruder (A) Roberto Di Salvo (CA) Audrey Mok", "release_date": "2019-07-24", "diamond_id": "MAY190889"}, {"publisher": "MARVEL COMICS", "description": "The Hulk smashes his way into the celebration of the House of Ideas' 80th anniversary with the latest issue of the era-spanning MARVEL TALES! This anthology series shines a spotlight on fan-favorite characters, features timeless stories and highlights some of the most impressive talent from the past eight decades. First, the Hulk returns to his original gray form in Al Milgrom's status quo-shattering INCREDIBLE HULK (1968) #324! Then, a blood transfusion from cousin Bruce Banner gives attorney Jennifer Walters a raging transformation of her own in SAVAGE SHE-HULK #1 - by the powerhouse team of Stan Lee and John Buscema! And Doc Samson manages to merge the Hulk's personas, creating the super-intelligent \"Professor\" Hulk in INCREDIBLE HULK (1968) #377 - a pivotal issue of Peter David's epic run, illustrated by superstar Dale Keown! Rated T ", "title": "MARVEL TALES HULK #1", "price": "$7.99", "creators": "(W) Peter David, Stan Lee, Al Milgrom (A) Al Milgrom, John Buscema, Dale Keown (CA) Jen Bartel", "release_date": "2019-07-24", "diamond_id": "MAY190806"}, {"publisher": "MARVEL COMICS", "description": "Celebrate the career of a true Marvel Visionary! Relive some of Rascally Roy Thomas' greatest stories as, under his pen, the Fantastic Four confronts racism, social injustice and...the Impossible Man?! Vision joins the Avengers! The Hulk finds his way to \"Heaven!\" Namor fights Dragon Man! Captain Marvel escapes the Murder Maze! The origin of the Invaders! Doctor Strange's secrets revealed! Dracula in Salem and the X-Men in Japan! And who is Starr the Slayer? Plus: Rarely seen Silver Age stories of humor and romance! Collecting MODELING WITH MILLIE #44; AVENGERS (1963) #35, #57-58 and #100; SUB-MARINER (1968) #8 and #14; CAPTAIN MARVEL (1968) #19; X-MEN (1963) #64; FANTASTIC FOUR (1961) #119 and #176; GIANT-SIZE INVADERS #1; and material from TALES OF SUSPENSE (1959) #73; NOT BRAND ECHH #12; CHAMBER OF DARKNESS #4; AMAZING ADVENTURES (1970) #8; INCREDIBLE HULK (1968) #147; DRACULA LIVES #1 and DOCTOR STRANGE, SORCERER SUPREME #9. Rated T ", "title": "MARVEL VISIONARIES TP ROY THOMAS", "price": "$34.99", "creators": "(W) Roy Thomas, Stan Lee, Dann Thomas (A) Stan Goldberg, Don Heck, More (CA) John Buscema, Frank Robbins", "release_date": "2019-07-24", "diamond_id": "MAY190951"}, {"publisher": "MARVEL COMICS", "description": "An all-new standalone epilogue to the classic MARVELS graphic novel written by Kurt Busiek and fully-painted by Alex Ross! A \"Marvels\" look at the \"all-new, all-different\" X-Men of the 1970s. In this 16-page story, Alex and Kurt bring Marvel's world to brilliant, realistic life one last time, as the now-retired Phil Sheldon and his daughters, in Manhattan to see the Christmas lights, find themselves in the middle of a clash between the outsider heroes and the deadly Sentinels, giving them a close-up perspective on the mutant experience. Also featuring a behind-the-scenes look at the making of this special story, and other bonus features. Rated T+ ", "title": "MARVELS EPILOGUE #1", "price": "$4.99", "creators": "(W) Kurt Busiek, Alex Ross (A/CA) Alex Ross", "release_date": "2019-07-24", "diamond_id": "MAY190681"}, {"publisher": "MARVEL COMICS", "description": "An all-new standalone epilogue to the classic MARVELS graphic novel written by Kurt Busiek and fully-painted by Alex Ross! A \"Marvels\" look at the \"all-new, all-different\" X-Men of the 1970s. In this 16-page story, Alex and Kurt bring Marvel's world to brilliant, realistic life one last time, as the now-retired Phil Sheldon and his daughters, in Manhattan to see the Christmas lights, find themselves in the middle of a clash between the outsider heroes and the deadly Sentinels, giving them a close-up perspective on the mutant experience. Also featuring a behind-the-scenes look at the making of this special story, and other bonus features. Rated T+ ", "title": "MARVELS EPILOGUE #1 LIM VAR", "price": "$4.99", "creators": "(W) Kurt Busiek, Alex Ross (A) Alex Ross (CA) Ron Lim", "release_date": "2019-07-24", "diamond_id": "MAY190684"}, {"publisher": "MARVEL COMICS", "description": "An all-new standalone epilogue to the classic MARVELS graphic novel written by Kurt Busiek and fully-painted by Alex Ross! A \"Marvels\" look at the \"all-new, all-different\" X-Men of the 1970s. In this 16-page story, Alex and Kurt bring Marvel's world to brilliant, realistic life one last time, as the now-retired Phil Sheldon and his daughters, in Manhattan to see the Christmas lights, find themselves in the middle of a clash between the outsider heroes and the deadly Sentinels, giving them a close-up perspective on the mutant experience. Also featuring a behind-the-scenes look at the making of this special story, and other bonus features. Rated T+ ", "title": "MARVELS EPILOGUE #1 YOUNG VAR", "price": "$4.99", "creators": "(W) Alex Ross, Kurt Busiek (A) Alex Ross (CA) Skottie Young", "release_date": "2019-07-24", "diamond_id": "MAY190685"}, {"publisher": "MARVEL COMICS", "description": "PERFECT FOR MIDDLE GRADE READERS! When Peter Parker falls, the world needs a Spider-Man - and young Miles Morales takes up the mantle! Before Peter died, Miles was poised to start the next chapter in his life in a new school. Then, a spider's bite granted the teenager incredible arachnid-like powers. Now, Miles has been thrust into a world he doesn't understand, with only gut instinct, his well-intentioned best friend Ganke and a little thing called responsibility as his guides. But what was the story behind the spider that bit him? How is Miles going to get his hands on a cool new costume? And is there any way he can be ready to face the deadly sting of the Scorpion? Find out if Miles Morales can live up to the legacy of Spider-Man! Ages 10+", "title": "MILES MORALES GN TP SPIDER-MAN", "price": "$12.99", "creators": "(W) Brian Michael Bendis (A) Chris Samnee, David Marquez (A/CA) Sara Pichelli", "release_date": "2019-07-24", "diamond_id": "APR190939"}, {"publisher": "MARVEL COMICS", "description": "THE END IS NEAR!Will Lunella and Devil be able to fix the Omni-Wave Projector and repair time? Not without help from Lunella's preteen parents... but she might accidentally erase herself from history in the process! Rated T ", "title": "MOON GIRL AND DEVIL DINOSAUR #45", "price": "$3.99", "creators": "(W) Brandon Montclare (A) Alitha Martinez (CA) Rahzzah", "release_date": "2019-07-24", "diamond_id": "MAY190877"}, {"publisher": "MARVEL COMICS", "description": "Frank Castle's relentless war continues in a trio of hard-hitting graphic novels! First, in a modern classic reuniting the creative team behind the Punisher's first solo series, Frank has a run-in with an old sergeant that takes him back to his Vietnam days - but this time they're on opposite sides! Then, a car accident leads to a killing spree, with the Punisher at the center of it - but will the members of a Japanese assassins guild become his allies, or are they out for Frank's blood? And a secret society is using murder to further its political ends - but slaughtering an innocent family puts its members in the Punisher's sights! From brutal hand-to-hand combat to aerial dogfights, these extra-length epics have it all! Collecting EPIC GRAPHIC NOVEL: PUNISHER - RETURN TO BIG NOTHING, MARVEL GRAPHIC NOVEL: PUNISHER - ASSASSIN'S GUILD and MARVEL GRAPHIC NOVEL: PUNISHER - INTRUDER. Rated T+ ", "title": "PUNISHER TP RETURN TO BIG NOTHING", "price": "$24.99", "creators": "(W) Steven Grant, Jo Duffy, Mike Baron (A) Jorge Zaffino, Bill Reinhold (A/CA) Mike Zeck", "release_date": "2019-07-24", "diamond_id": "MAY190982"}, {"publisher": "MARVEL COMICS", "description": "", "title": "SAVAGE SWORD OF CONAN #6 2ND PTG FINCH VAR", "price": "$3.99", "creators": "(W) Meredith Finch (A) Luke Ross (CA) David Finch", "release_date": "2019-07-24", "diamond_id": "MAY198640"}, {"publisher": "MARVEL COMICS", "description": "The ancient cult of Koga Thun. A mystical treasure. And the only man who can save the Hyborian Age! But Conan is adrift at sea with no food and no weapons. Death surely awaits him. But by Crom, the lionhearted barbarian is not so easily subdued! When Conan is captured, he unleashes his might on an unsuspecting pirate crew - one whose dark secrets will set him on the trail of an ancient fortune that may prove to be his undoing! Back on the shores of Stygia, a magical guide directs Conan toward dreaded civilization - but it will take all his strength and wits to make his way through the ruined city that awaits him. For to get there, Conan must survive the death cult of sorcerer Koga Thun! Collecting SAVAGE SWORD OF CONAN (2019) #1-5. Parental Advisory ", "title": "SAVAGE SWORD OF CONAN TP VOL 01 CULT OF KOGA THUN", "price": "$17.99", "creators": "(W) Gerry Duggan (A) Ron Garney (CA) Alex Ross", "release_date": "2019-07-24", "diamond_id": "MAY190954"}, {"publisher": "MARVEL COMICS", "description": "The saga of the death cult of Koga Thun - in brutal black and white! This special collection features the sword-and-sorcery epic brought to life - and death - by Ron Garney's sensational inked pages, printed without color so you can savor every barbaric detail! Collecting SAVAGE SWORD OF CONAN (2019) #1-5. Parental Advisory ", "title": "SAVAGE SWORD OF CONAN TP VOL 01 CULT OF KOGA THUN B&W DM VAR", "price": "$17.99", "creators": "(W) Gerry Duggan (A/CA) Ron Garney", "release_date": "2019-07-24", "diamond_id": "MAY190955"}, {"publisher": "MARVEL COMICS", "description": "\"SECRET WARPS,\" PART 4 - SUPREMEUNIVERSAL! The web-spinning Arachknight finds himself out of the depth of all four of his personas as his own warped universe begins colliding with another - the New Supreme Universe, homes of the Supreme Seven! PLUS: A bonus tale of ol' AK trying to persuade the Terrific Two to become a Trio! Rated T+ ", "title": "SECRET WARPS ARACHKNIGHT ANNUAL #1", "price": "$4.99", "creators": "(W) Al Ewing, Jim Zub (A) Carlos Villa, Carlo Barberi (CA) Carlos E. Gomez", "release_date": "2019-07-24", "diamond_id": "MAY190790"}, {"publisher": "MARVEL COMICS", "description": "\"SECRET WARPS,\" PART 4 - SUPREMEUNIVERSAL! The web-spinning Arachknight finds himself out of the depth of all four of his personas as his own warped universe begins colliding with another - the New Supreme Universe, homes of the Supreme Seven! PLUS: A bonus tale of ol' AK trying to persuade the Terrific Two to become a Trio! Rated T+ ", "title": "SECRET WARPS ARACHKNIGHT ANNUAL #1 PACHECO CONNECTING VAR", "price": "$4.99", "creators": "(W) Al Ewing, Jim Zub (A) Carlos Villa, Carlo Barberi (CA) Carlos Pacheco", "release_date": "2019-07-24", "diamond_id": "MAY190791"}, {"publisher": "MARVEL COMICS", "description": "INTO THE DJALIA! The alien creature that followed Princess Shuri to Wakanda is inches from destroying the Great Mound - and taking Shuri's friends with it! With her Ancient Future powers gone and Wakanda's entire supply of Vibranium at risk, Princess Shuri must take a leap of faith - into the plane of Wakandan memory. But will Shuri restore the Djalia...or doom it? Rated T ", "title": "SHURI #10", "price": "$3.99", "creators": "(W) Nnedi Okorafor (A) Rachael Stott (CA) Kirbi Fagan", "release_date": "2019-07-24", "diamond_id": "MAY190861"}, {"publisher": "MARVEL COMICS", "description": "", "title": "SPIDER-MAN CITY AT WAR #4 (OF 6) 2ND PTG BANDINI VAR", "price": "$3.99", "creators": "(W) Dennis \"Hopeless\" Hallum (A/CA) Michele Bandini", "release_date": "2019-07-24", "diamond_id": "MAY198639"}, {"publisher": "MARVEL COMICS", "description": "", "title": "SPIDER-MAN LIFE STORY #1 (OF 6) 3RD PTG ZDARSKY VAR", "price": "$4.99", "creators": "(W) Chip Zdarsky (A) Mark Bagley, John Dell (CA) Chip Zdarsky", "release_date": "2019-07-24", "diamond_id": "MAY198641"}, {"publisher": "MARVEL COMICS", "description": "", "title": "SPIDER-MAN LIFE STORY #2 (OF 6) 3RD PTG ZDARSKY VAR", "price": "$4.99", "creators": "(W) Chip Zdarsky (A) Mark Bagley, Andrew Hennessy (CA) Chip Zdarsky", "release_date": "2019-07-24", "diamond_id": "MAY198642"}, {"publisher": "MARVEL COMICS", "description": "TRICKS AND TRAPS! The REBELS AND ROGUES epic continues as our heroes deploy their plans to trick their Imperial pursuers... and everything falls apart! CHEWIE and THREEPIO face moral quandaries - and mortal danger - when they learn the uninhabited planet they're supposed to destroy isn't quite so uninhabited. Will the FORCE be with LUKE in a bar fight? And who is DAR CHAMPION... and what does he have to do with Leia's past? Rated T ", "title": "STAR WARS #69", "price": "$3.99", "creators": "(W) Greg Pak (A/CA) Phil Noto", "release_date": "2019-07-24", "diamond_id": "MAY190915"}, {"publisher": "MARVEL COMICS", "description": "MIGHTY MARVEL MARTIAL ARTS DOUBLE TROUBLE! ALL NEW ONGOING SERIES! You saw him tear through Fire Goblins in WAR OF THE REALMS with his big, damn magic sword! Now learn the mysterious origins of LIN LIE, A.K.A. SWORD MASTER, Marvel's newest Chinese superhero, in the English language debut of the original series written by Shuizhu and drawn by Gunji! Haunted by dreams of demons, Lin Lie hunts for his missing archeologist father - and for the secret of the black sword he left behind. And in a brand new story written by Greg Pak (NEW AGENTS OF ATLAS), Sword Master teams up with SHANG-CHI! What happens when an undisciplined, untrained kid with a magic sword tangles with the one and only, undisputed MASTER OF KUNG FU? (Spoiler alert: they will indeed drive each other crazy, with huge ramifications for the Marvel Universe!) Rated T ", "title": "SWORD MASTER #1", "price": "$3.99", "creators": "(W) Shuizhu, Greg Pak (A) Kris Anka (A/CA) Gunji", "release_date": "2019-07-24", "diamond_id": "MAY190757"}, {"publisher": "MARVEL COMICS", "description": "Join Thor and his family on a titanic tour of the Ten Realms! Witness the ancient origin of Yggdrasil the World-Tree! Thor leads a desperate battle against the relentless Mangog - for Asgard! Learn how a foolhardy adventure in Niffleheim led young Thor to be banished! Loki declares war on Midgard - and visits his childhood self in Jotunheim! From Svartalfheim, Dark Elf Malekith plots to unleash the Casket of Ancient Winters - and Odin recalls the ancient trip to Muspelheim that began his age-old rivalry with Surtur! Plus: Alfheim! Vanaheim! Nidavellir's role in the origin of Mjolnir! And the stunning revelation of the Tenth Realm of Heven! Collecting THOR (1966) #157, #159, #233-234 and #347-349; THOR (2007) #12; THOR: THE TRIAL OF THOR; MIGHTY THOR (2015) #12; ORIGINAL SIN #5.1; and material from JOURNEY INTO MYSTERY (1952) #97 and THOR (1966) #400. Rated T+ ", "title": "THOR OF REALMS TP", "price": "$29.99", "creators": "(W) Stan Lee, Gerry Conway, More (A) Jack Kirby, John Buscema, More (CA) Olivier Coipel", "release_date": "2019-07-24", "diamond_id": "MAY190957"}, {"publisher": "MARVEL COMICS", "description": "\"THE ONE-STEP PROGRAM\"-When Iron Man tells Captain Marvel that he can't be her sponsor because he may or may not have fallen off the wagon, Carol doesn't it take it well. What is Tony Stark's new high-tech solution for sobriety? Find out why this might be his worst idea yet. Featuring the villainy of the all-new Spymaster. And follow Jocasta as she decides to go all in for \"the ultimate upgrade.\" Rated T+ ", "title": "TONY STARK IRON MAN #14", "price": "$3.99", "creators": "(W) Dan Slott, Jim Zub (A) Valerio Schiti (CA) In-Hyuk Lee", "release_date": "2019-07-24", "diamond_id": "MAY190738"}, {"publisher": "MARVEL COMICS", "description": "\"THE ONE-STEP PROGRAM\"-When Iron Man tells Captain Marvel that he can't be her sponsor because he may or may not have fallen off the wagon, Carol doesn't it take it well. What is Tony Stark's new high-tech solution for sobriety? Find out why this might be his worst idea yet. Featuring the villainy of the all-new Spymaster. And follow Jocasta as she decides to go all in for \"the ultimate upgrade.\" Rated T+ ", "title": "TONY STARK IRON MAN #14 FERRY CARNAGE-IZED VAR", "price": "$3.99", "creators": "(W) Dan Slott, Jim Zub (A) Valerio Schiti (CA) Pasqual Ferry", "release_date": "2019-07-24", "diamond_id": "MAY190739"}, {"publisher": "MARVEL COMICS", "description": "Reprinting Venom (2003) #1! Rated T ", "title": "TRUE BELIEVERS ABSOLUTE CARNAGE MANIA #1", "price": "$1.00", "creators": "", "release_date": "2019-07-24", "diamond_id": "MAY190771"}, {"publisher": "MARVEL COMICS", "description": "Reprinting Venom: Separation Anxiety (1994) #1! Rated T ", "title": "TRUE BELIEVERS ABSOLUTE CARNAGE SEPARATION ANXIETY #1", "price": "$1.00", "creators": "", "release_date": "2019-07-24", "diamond_id": "MAY190772"}, {"publisher": "MARVEL COMICS", "description": "JANE FOSTER STARS IN AN ALL-NEW NEW ONGOING SERIES! A new hero emerges straight from the pages of THE WAR OF THE REALMS! For years, you knew her as Dr. Jane Foster, one of Thor's most steadfast companions. Then you knew her as Thor, the Goddess of Thunder, who took up the mantle when no other hero - god or human - was worthy. Now Jane takes on a new role as Valkyrie, guide and ferrywoman to the dead! But her days of punching are far from over. WAR OF THE REALMS master architect Jason Aaron and superstar Al Ewing (IMMORTAL HULK) join forces with rising star artist CAFU for the book that'll have everyone talking! Rated T+ ", "title": "VALKYRIE JANE FOSTER #1", "price": "$3.99", "creators": "(W) Jason Aaron, Al Ewing (A) CAFU (CA) Mahmud A. Asrar", "release_date": "2019-07-24", "diamond_id": "MAY190727"}, {"publisher": "MARVEL COMICS", "description": "JANE FOSTER STARS IN AN ALL-NEW NEW ONGOING SERIES! A new hero emerges straight from the pages of THE WAR OF THE REALMS! For years, you knew her as Dr. Jane Foster, one of Thor's most steadfast companions. Then you knew her as Thor, the Goddess of Thunder, who took up the mantle when no other hero - god or human - was worthy. Now Jane takes on a new role as Valkyrie, guide and ferrywoman to the dead! But her days of punching are far from over. WAR OF THE REALMS master architect Jason Aaron and superstar Al Ewing (IMMORTAL HULK) join forces with rising star artist CAFU for the book that'll have everyone talking! Rated T+ ", "title": "VALKYRIE JANE FOSTER #1 HETRICK VAR", "price": "$3.99", "creators": "(W) Jason Aaron, Al Ewing (A) CAFU (CA) Meghan Hetrick", "release_date": "2019-07-24", "diamond_id": "MAY190730"}, {"publisher": "MARVEL COMICS", "description": "", "title": "WAR OF REALMS NEW AGENTS OF ATLAS #1 (OF 4) 3RD PTG VAR", "price": "$3.99", "creators": "(W) Greg Pak (A) Lim, Gang Hyuk (CA) Billy Tan", "release_date": "2019-07-24", "diamond_id": "MAY198628"}, {"publisher": "MARVEL COMICS", "description": "For weeks, the serial killer called Carnage has been hunting former symbiote hosts and killing them. Next on his list is ANDI BENTON, formerly MANIA, who's back to living in Philadelphia and without any symbiote to save her...   The path of bodies that leads to ABSOLUTE CARNAGE continues here! Rated T+ ", "title": "WEB OF VENOM FUNERAL PYRE #1", "price": "$4.99", "creators": "(W) Cullen Bunn (A) Alberto Jimenez Alburquerque, Joshua Cassara (CA) Declan Shalvey", "release_date": "2019-07-24", "diamond_id": "MAY190842"}, {"publisher": "MARVEL COMICS", "description": "Jean Grey makes the ultimate sacrifice in the heartbreaking climax of the unforgettable Dark Phoenix Saga! Summoned by the alien Shi'ar to answer for the cosmic crimes of the Phoenix, Jean Grey must stand trial - by combat! The X-Men and the Shi'ar Imperial Guard do battle on the moon to decide Jean's fate! But can she keep her dark side under control? Or will the Dark Phoenix rise against her friends? One of the greatest love stories in all of comics - Jean Grey and Scott Summers - ends in tragedy in an issue that shocked X-Men fans and sent ripples through the entire comics industry! It's one of the all-time great Marvel comic books, boldly re-presented in its original form, ads and all! Reprinting X-MEN (1963) #137. Rated T ", "title": "X-MEN #137 FACSIMILE EDITION", "price": "$4.99", "creators": "(W) Chris Claremont, John Byrne (A/CA) John Byrne", "release_date": "2019-07-24", "diamond_id": "MAY190764"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "Chapter 5: End of the Road. The whole twisted 10-issue symphony comes to a rousing, cacophonous crescendo. David races to stop Cordrey from making a deal that would gravely affect the balance of power in the world. Garret takes an ugly ride on Con Air. Rook has a teary-eyed reunion with his beloved parrot, acquires a cracking new pet fish, and then he leaps from a C-130 without a parachute. Although we've come... to the end of the road... still I can't let go...", "title": "ABERRANT SEASON 2 #5 (OF 5) CVR A LEON DIAS (MR)", "price": "$3.99", "creators": "(W) Rylend Grant (A/CA) Davi Leon Dias", "release_date": "2019-07-24", "diamond_id": "APR191266"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "CHAPTER 5: END OF THE ROAD. The whole twisted 10-issue symphony comes to a rousing, cacophonous crescendo. David races to stop Cordrey from making a deal that would gravely affect the balance of power in the world. Garret takes an ugly ride on CON AIR. Rook has a teary-eyed reunion with his beloved parrot, acquires a cracking new pet fish, and then he leaps from a C-130 without a parachute. Although we've come... to the end of the road... still I can't let go...", "title": "ABERRANT SEASON 2 #5 (OF 5) CVR B LEON DIAS (MR)", "price": "$3.99", "creators": "(W) Rylend Grant (A/CA) Davi Leon Dias", "release_date": "2019-07-24", "diamond_id": "APR191267"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "A U.S. Army Special Operations Commander must team with the man he hates most in this world, a wildly eccentric, usually very drunken, former superhero, to bring down the renegade General responsible for the deaths of his unit.", "title": "ABERRANT SEASON 2 TP (MR)", "price": "$14.99", "creators": "(W) Rylend Grant (A/CA) Davi Leon Dias", "release_date": "2019-07-24", "diamond_id": "MAY191285"}, {"publisher": "RED 5 COMICS", "description": "Featured on Free Comic Book Day, Afterburn returns ahead of its big screen debut!After successfully raiding the relics from Notre Dame Cathedral, Jake realizes that he has unexpectedly sent his friends into a mutant trap in Rome. Now he must race there to rescue them with rival treasure hunters and vengeful mutants hot on his heels!", "title": "AFTERBURN CROSSFIRE #3 (OF 4)", "price": "$3.95", "creators": "(W) Scott Chitwood (A/CA) Rod Thornton", "release_date": "2019-07-24", "diamond_id": "MAY191884"}, {"publisher": "NOBROW - FLYING EYE BOOKS", "description": "The plucky, troublemaking Akissi is back with her mischief on The Ivory Coast! This time, she has to keep herself from drowning, stand up to a bully, make peace with her arch nemesis, the prettiest girl in school, and evade a witch doctor's potion. Inspired by her childhood, writer Marguerite Abouet takes readers on even more hilarious adventures. Lessons learned along the way include being friends with people you don't like, standing up for yourself, and dealing with the consequences of your actions.", "title": "AKISSI MORE TALES OF MISCHIEF GN", "price": "$14.95", "creators": "(W) Marguerite Abouet (A/CA) Mathieu Sapin", "release_date": "2019-07-24", "diamond_id": "MAY191835"}, {"publisher": "AMERICAN MYTHOLOGY PRODUCTIONS", "description": "Well that's another fine mess you've gotten us into! American Mythology is proud to bring a classic Laurel & Hardy comic issue back to fans. Back in 1967 Gold Key re-introduced the loveable duo to comic audiences and we are thrilled to present that issue in its entirety to a brand-new generation of readers! AM Archives Laurel & Hardy #1 1967 is available with two editions - Main and a 350 copy Ltd Edition retro cover! ", "title": "AM ARCHIVES LAUREL & HARDY #1 CVR A 1967 MAIN", "price": "$3.99", "creators": "(W) Various (A) Various", "release_date": "2019-07-24", "diamond_id": "MAY191356"}, {"publisher": "AMERICAN MYTHOLOGY PRODUCTIONS", "description": "Well that's another fine mess you've gotten us into! American Mythology is proud to bring a classic Laurel & Hardy comic issue back to fans. Back in 1967 Gold Key re-introduced the loveable duo to comic audiences and we are thrilled to present that issue in its entirety to a brand-new generation of readers! AM Archives Laurel & Hardy #1 1967 is available with two editions - Main and a 350 copy Ltd Edition retro cover! ", "title": "AM ARCHIVES LAUREL & HARDY #1 CVR B 1967 LTD ED RETRO", "price": "$9.99", "creators": "(W) Various (A) Various", "release_date": "2019-07-24", "diamond_id": "MAY191357"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Archie and Sabrina are the hottest couple in Riverdale-but how did their whirlwind romance come to be? This issue introduces readers to the history of their magical love story, as we welcome special co-writer Mariko Tamaki to the Archie universe!", "title": "ARCHIE #706 (ARCHIE & SABRINA PT 2) CVR A FISH (RES)", "price": "$3.99", "creators": "(W) Nick Spencer, Mariko Tamaki (A) Sandy Jarrell (CA) Veronica Fish", "release_date": "2019-07-24", "diamond_id": "MAY191423"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Archie and Sabrina are the hottest couple in Riverdale-but how did their whirlwind romance come to be? This issue introduces readers to the history of their magical love story, as we welcome special co-writer Mariko Tamaki to the Archie universe!", "title": "ARCHIE #706 (ARCHIE & SABRINA PT 2) CVR B ISAACS (RES)", "price": "$3.99", "creators": "(W) Nick Spencer, Mariko Tamaki (A) Sandy Jarrell (CA) Rebekah Isaacs", "release_date": "2019-07-24", "diamond_id": "MAY191424"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Archie and Sabrina are the hottest couple in Riverdale-but how did their whirlwind romance come to be? This issue introduces readers to the history of their magical love story, as we welcome special co-writer Mariko Tamaki to the Archie universe!", "title": "ARCHIE #706 (ARCHIE & SABRINA PT 2) CVR C MOONEY (RES)", "price": "$3.99", "creators": "(W) Nick Spencer, Mariko Tamaki (A) Sandy Jarrell (CA) Stephen Mooney", "release_date": "2019-07-24", "diamond_id": "MAY191425"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "For 161 issues, Archie's craziest interactions with Riverdale High principal Mr. Weatherbee were showcased in this classic series. This second collection continues the adventures (and misadventures) of the red-headed teen and his long-suffering principal!", "title": "ARCHIE & ME TP VOL 02", "price": "$10.99", "creators": "(W) Various (A) Various (CA) Dan DeCarlo", "release_date": "2019-07-24", "diamond_id": "MAY191428"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Betty, Veronica, and Predator-Archie have been left in the wreckage of their town, all their friends dead. Normally, they'd just go down Memory Lane and get home again where everything's okay, but that's no longer an option. It isn't until they find an undamaged car and drive it down a different road where they can finally return to Riverdale-but their hometown feels different. And it's made even more bizarre when they come face-to-face with a few people they'd never expect: themselves. Only different, newer versions. Little do they know, Predators on Mars are watching them-planning their next attack. ", "title": "ARCHIE VS PREDATOR 2 #1 (OF 5) CVR A HACK", "price": "$3.99", "creators": "(W) Alex De Campi (A/CA) Robert Hack", "release_date": "2019-07-24", "diamond_id": "MAY191404"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Betty, Veronica, and Predator-Archie have been left in the wreckage of their town, all their friends dead. Normally, they'd just go down Memory Lane and get home again where everything's okay, but that's no longer an option. It isn't until they find an undamaged car and drive it down a different road where they can finally return to Riverdale-but their hometown feels different. And it's made even more bizarre when they come face-to-face with a few people they'd never expect: themselves. Only different, newer versions. Little do they know, Predators on Mars are watching them-planning their next attack. ", "title": "ARCHIE VS PREDATOR 2 #1 (OF 5) CVR B BURCHETT", "price": "$3.99", "creators": "(W) Alex De Campi (A) Robert Hack (CA) Rick Burchett", "release_date": "2019-07-24", "diamond_id": "MAY191405"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Betty, Veronica, and Predator-Archie have been left in the wreckage of their town, all their friends dead. Normally, they'd just go down Memory Lane and get home again where everything's okay, but that's no longer an option. It isn't until they find an undamaged car and drive it down a different road where they can finally return to Riverdale-but their hometown feels different. And it's made even more bizarre when they come face-to-face with a few people they'd never expect: themselves. Only different, newer versions. Little do they know, Predators on Mars are watching them-planning their next attack. ", "title": "ARCHIE VS PREDATOR 2 #1 (OF 5) CVR C DEREK CHARM", "price": "$3.99", "creators": "(W) Alex De Campi (A) Robert Hack (CA) Derek Charm", "release_date": "2019-07-24", "diamond_id": "MAY191406"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Betty, Veronica, and Predator-Archie have been left in the wreckage of their town, all their friends dead. Normally, they'd just go down Memory Lane and get home again where everything's okay, but that's no longer an option. It isn't until they find an undamaged car and drive it down a different road where they can finally return to Riverdale-but their hometown feels different. And it's made even more bizarre when they come face-to-face with a few people they'd never expect: themselves. Only different, newer versions. Little do they know, Predators on Mars are watching them-planning their next attack. ", "title": "ARCHIE VS PREDATOR 2 #1 (OF 5) CVR D FRANCAVILLA", "price": "$3.99", "creators": "(W) Alex De Campi (A) Robert Hack (CA) Francesco Fancavilla", "release_date": "2019-07-24", "diamond_id": "MAY191407"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Betty, Veronica, and Predator-Archie have been left in the wreckage of their town, all their friends dead. Normally, they'd just go down Memory Lane and get home again where everything's okay, but that's no longer an option. It isn't until they find an undamaged car and drive it down a different road where they can finally return to Riverdale-but their hometown feels different. And it's made even more bizarre when they come face-to-face with a few people they'd never expect: themselves. Only different, newer versions. Little do they know, Predators on Mars are watching them-planning their next attack. ", "title": "ARCHIE VS PREDATOR 2 #1 (OF 5) CVR E DAN PARENT", "price": "$3.99", "creators": "(W) Alex De Campi (A) Robert Hack (CA) Dan Parent", "release_date": "2019-07-24", "diamond_id": "MAY191408"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "Betty, Veronica, and Predator-Archie have been left in the wreckage of their town, all their friends dead. Normally, they'd just go down Memory Lane and get home again where everything's okay, but that's no longer an option. It isn't until they find an undamaged car and drive it down a different road where they can finally return to Riverdale-but their hometown feels different. And it's made even more bizarre when they come face-to-face with a few people they'd never expect: themselves. Only different, newer versions. Little do they know, Predators on Mars are watching them-planning their next attack. ", "title": "ARCHIE VS PREDATOR 2 #1 (OF 5) CVR F TUCCI", "price": "$3.99", "creators": "(W) Alex De Campi (A) Robert Hack (CA) Billy Tucci", "release_date": "2019-07-24", "diamond_id": "MAY191409"}, {"publisher": "LION FORGE", "description": "Determined to find Arlo, Ludo takes things into his own hands and starts to look outside of the base, only to discover her trail picks up in the most unexpected of places. The further Ludo gets into his investigation, the more he questions how well everyone on base, in town, and even he himself really knew her.", "title": "AT THE END OF YOUR TETHER #2 (OF 3)", "price": "$4.99", "creators": "(W) Adam Smith (A) Vv Glass (CA) Deena So'Oteh", "release_date": "2019-07-24", "diamond_id": "MAY191793"}, {"publisher": "ARCHIE COMIC PUBLICATIONS", "description": "BRAND NEW STORY: \"What If?\" This story explores an unusual scenario... What if Jughead was the guy both girls were after?! ", "title": "BETTY & VERONICA JUMBO COMICS DIGEST #275", "price": "$6.99", "creators": "(W) Bill Golliher (A) Dan Parent, Rich Koslowski (CA) Jeff Shultz", "release_date": "2019-07-24", "diamond_id": "MAY191432"}, {"publisher": "VIZ MEDIA LLC", "description": "When Conan gets an invitation to London, he's thrilled. What could be better than visiting the home of his hero, Sherlock Holmes? But there's only one way he can get there: by becoming Jimmy Kudo again! Temporarily returned to his true age, Jimmy sets out on the trail of a devilish serial killer plotting an attack at the Wimbledon tournament. With London in turmoil, can Jimmy find a chance to confess his feelings to Rachel, or will love mean zero in tennis as well as well as in life? For older teen audiences.", "title": "CASE CLOSED GN VOL 71", "price": "$9.99", "creators": "(W) Gosho Aoyama (A/CA) Gosho Aoyama", "release_date": "2019-07-24", "diamond_id": "MAY192163"}, {"publisher": "AMRYL ENTERTAINMENT", "description": "When a Marshville logging crew goes missing Meriem forms a search party and goes deep in the jungle to look for them. What they find is beyond their wildest nightmares and pushes Meriem to her limits. Can Meriem and company find the missing logging crew (which includes Carrie's ex-boyfriend) and get back to get back to Marshville before they meet the same fate? ", "title": "CAVEWOMAN RESCUE PARTY ONE SHOT COVER A MASSEY (MR)", "price": "$3.99", "creators": "(W) Devon Massey (A/CA) Devon Massey", "release_date": "2019-07-24", "diamond_id": "MAR191439"}, {"publisher": "AMRYL ENTERTAINMENT", "description": "When a Marshville logging crew goes missing Meriem forms a search party and goes deep in the jungle to look for them. What they find is beyond their wildest nightmares and pushes Meriem to her limits.  Can Meriem and company find the missing logging crew (which includes Carrie's ex-boyfriend) and get back to get back to Marshville before they meet the same fate? ", "title": "CAVEWOMAN RESCUE PARTY ONE SHOT COVER D BUDD ROOT  (MR)", "price": "$PI", "creators": "(W) Devon Massey (A) Devon Massey (CA) Budd Root", "release_date": "2019-07-24", "diamond_id": "MAR191442"}, {"publisher": "AMRYL ENTERTAINMENT", "description": "When a Marshville logging crew goes missing Meriem forms a search party and goes deep in the jungle to look for them. What they find is beyond their wildest nightmares and pushes Meriem to her limits.  Can Meriem and company find the missing logging crew (which includes Carrie's ex-boyfriend) and get back to get back to Marshville before they meet the same fate? ", "title": "CAVEWOMAN RESCUE PARTY ONE SHOT COVER E BUDD ROOT SPEC ED NU", "price": "$PI", "creators": "(W) Devon Massey (A) Devon Massey (CA) Budd Root", "release_date": "2019-07-24", "diamond_id": "MAR191443"}, {"publisher": "AMRYL ENTERTAINMENT", "description": "When a Marshville logging crew goes missing Meriem forms a search party and goes deep in the jungle to look for them. What they find is beyond their wildest nightmares and pushes Meriem to her limits.  Can Meriem and company find the missing logging crew (which includes Carrie's ex-boyfriend) and get back to get back to Marshville before they meet the same fate? ", "title": "CAVEWOMAN RESCUE PARTY ONE SHOT COVER F YEN SAN SPEC ED TOPL", "price": "$PI", "creators": "(W) Devon Massey (A) Devon Massey (CA) Yen San", "release_date": "2019-07-24", "diamond_id": "MAR191444"}, {"publisher": "AMRYL ENTERTAINMENT", "description": "When a Marshville logging crew goes missing Meriem forms a search party and goes deep in the jungle to look for them. What they find is beyond their wildest nightmares and pushes Meriem to her limits.  Can Meriem and company find the missing logging crew (which includes Carrie's ex-boyfriend) and get back to get back to Marshville before they meet the same fate? ", "title": "CAVEWOMAN RESCUE PARTY ONE SHOT COVER G FANTINI TOPLESS CVR", "price": "$PI", "creators": "(W) Devon Massey (A) Devon Massey (CA) Yen San", "release_date": "2019-07-24", "diamond_id": "MAR191445"}, {"publisher": "SCOUT COMICS", "description": "Jesus had The Apostles, and The Christ has The Twelve - a dedicated collection of true believers whose sordid and sinister pasts Lucas learns about from a trusted source. Meanwhile, Sujad exacts revenge on a familiar face, and a momentary lapse in judgment causes Larry to reconsider a previous offer.", "title": "CRUCIFIED #2", "price": "$3.99", "creators": "(W) Sheldon Allen (A) Armin Ozdic", "release_date": "2019-07-24", "diamond_id": "MAY191892"}, {"publisher": "AFTERSHOCK COMICS", "description": "Chip is trapped in an abandoned oil refinery with an army of Nazi vampires - his only allies are a sick woman and a fumbling alcoholic. The end is near. Doom awaits. And Chip - the angry, lonely rural vampire - finally gets his chance to be a good guy. Tim Seeley (BRILLIANT TRASH, Hack/Slash, Grayson) and Corin Howell (Ghostbusters, Bat-Mite) bring you a contemporary and horrifying tale of vampirism in the heart of America - one that'll make you jump right out of your boots.", "title": "DARK RED #5", "price": "$3.99", "creators": "(W) Tim Seeley (A) Corin Howell (CA) Aaron Campbell", "release_date": "2019-07-24", "diamond_id": "MAY191313"}, {"publisher": "KEVIN EASTMAN STUDIOS", "description": "A funeral, an angry widow, a talking statue, a crazed mob, a silent-movie nightmare and a real-life faceoff with murderous Lithuanian gangsters... it's just another tricky day for Shane \"Books\" Bookman, a comic book creator who rode the roller coaster of fame and fortune and ended up...in a whole lotta trouble. Will he live to see the next issue?", "title": "DRAWING BLOOD SPILLED INK #3 (OF 4) CVR A BISHOP (MR)", "price": "$3.99", "creators": "(W) Kevin Eastman, David Avallone (A) Kevin Eastman, Troy Little (A/CA) Ben Bishop", "release_date": "2019-07-24", "diamond_id": "MAY191787"}, {"publisher": "KEVIN EASTMAN STUDIOS", "description": "A funeral, an angry widow, a talking statue, a crazed mob, a silent-movie nightmare and a real-life faceoff with murderous Lithuanian gangsters... it's just another tricky day for Shane \"Books\" Bookman, a comic book creator who rode the roller coaster of fame and fortune and ended up...in a whole lotta trouble. Will he live to see the next issue? Co-created by Kevin Eastman (Teenage Mutant Ninja Turtles) and David Avallone (Elvira, Bettie Page). Script by David Avallone, art by Ben Bishop (The Aggregate, TMNT Macro-Series), Kevin Eastman, and Troy Little (Rick and Morty, Fear and Loathing in Los Vegas.)", "title": "DRAWING BLOOD SPILLED INK #3 (OF 4) CVR B EASTMAN (MR)", "price": "$3.99", "creators": "(W) Kevin Eastman, David Avallone (A) Ben Bishop, Troy Little (A/CA) Kevin Eastman", "release_date": "2019-07-24", "diamond_id": "MAY191788"}, {"publisher": "SCOUT COMICS", "description": "The Electric Black - a cursed antique shop appearing in any time or space, soliciting customers it hungers to corrupt or devour! The Electric Black appears in 1990's Boston, Massachusetts. The enigmatic Julius Black has sent the store's demented errand girl, June Bug, on an assignment to drop off an ancient relic to a mysterious client. This ominous artifact has a sinister past and the power to throw the world into chaos. An Inquisition Strike Force is on her trail and determined to quell the darkness that she and the mysterious emporium are unleashing. One psychotic young woman against a group of heavily armed men? They don't stand a chance! Dare you step within the foreboding halls of the Electric Black?", "title": "ELECTRIC BLACK #2", "price": "$3.99", "creators": "(W) Joseph Schmalke (A) Rich Woodall", "release_date": "2019-07-24", "diamond_id": "MAY191893"}, {"publisher": "ANTARCTIC PRESS", "description": "As Gina begins construction on the \"Aperture\", gathering the energy she needs to jump home, she is ambushed by an interdimensional science ninja team.They intend to use her freshly rebuilt portal to escape the fury of a mournful, cybernetic psychopath who, thanks to them, has lost his entire family!Can Gina escape the science-ninjas and evade the wrath of the \"Bionic One\"...?", "title": "GOLD DIGGER #265", "price": "$3.99", "creators": "(W) Fred Perry (A) Fred Perry", "release_date": "2019-07-24", "diamond_id": "FEB191413"}, {"publisher": "ALBATROSS FUNNYBOOKS", "description": "Eddie has finally found a way to turn human again; it's too bad the cure is lodged inside Jimmy the Keeper, human warehouse and uptight snob! Making matters worse, Tala wants to keep the cure for herself, even if it means that Eddie stays a dog forever! Is this the beginning of the end for Eddie and Tala's partnership? Find out inside, Grumble fans!", "title": "GRUMBLE #8 (OF 5)", "price": "$3.99", "creators": "(W) Rafer Roberts (A/CA) Mike Norton, Marissa Louise", "release_date": "2019-07-24", "diamond_id": "MAY191327"}, {"publisher": "MAD CAVE STUDIOS", "description": "The final issue of the supernatural, shinobi thriller is here! With his life spiraling out of control, Genshi rushes back to Iga village in order to clear his name and save Akemi. But upon his arrival, Genshi is confronted by Lord Haruki, and Haruki's true intentions are revealed. Will the village embrace Genshi? Will Akemi choose Genshi over her own Father? Will Genshi finally embrace his Tengu? Find out in the final issue!", "title": "HONOR AND CURSE #6", "price": "$3.99", "creators": "(W) Mark London (A/CA) Nicolas Salamanca", "release_date": "2019-07-24", "diamond_id": "MAY191812"}, {"publisher": "YEN PRESS", "description": "Whether it's bedding a genuine succubus, some female-knight roleplaying, or an egg-laying kink, Stunk and the other Interspecies Reviewers go deep down the righteous path of carnal desire! But what's up with Crim? He's always wanted to visit a succubus, but now he's undergoing some transformation...?! For Ages 18 And Up", "title": "INTERSPECIES REVIEWERS GN VOL 02 (MR)", "price": "$13.00", "creators": "(W) Amahara (A) Masha", "release_date": "2019-07-24", "diamond_id": "MAY192197"}, {"publisher": "HEAVY METAL MAGAZINE", "description": "Iron Maiden's Eddie continues to battle evil in a city of eternal night... but he can't do it alone! Now, teamed-up with edgy rocker, Charlotte, Eddie continues his fight against an all-powerful force threatening the world... and maybe even the fabric of the universe itself! Available in three cover variants!", "title": "IRON MAIDEN LEGACY O/T BEAST VOL 2 NIGHT CITY #2 CVR A TBD", "price": "$3.99", "creators": "(W) Llexi Leon, Ian Edington (A) Kevin West (CA) TBD", "release_date": "2019-07-24", "diamond_id": "MAR191799"}, {"publisher": "HEAVY METAL MAGAZINE", "description": "Iron Maiden's Eddie continues to battle evil in a city of eternal night... but he can't do it alone! Now, teamed-up with edgy rocker, Charlotte, Eddie continues his fight against an all-powerful force threatening the world... and maybe even the fabric of the universe itself! Available in three cover variants!", "title": "IRON MAIDEN LEGACY O/T BEAST VOL 2 NIGHT CITY #2 CVR B TBD", "price": "$3.99", "creators": "(W) Llexi Leon, Ian Edginton (A) Kevin West (CA) TBD", "release_date": "2019-07-24", "diamond_id": "MAR191800"}, {"publisher": "HEAVY METAL MAGAZINE", "description": "Iron Maiden's Eddie continues to battle evil in a city of eternal night... but he can't do it alone! Now, teamed-up with edgy rocker, Charlotte, Eddie continues his fight against an all-powerful force threatening the world... and maybe even the fabric of the universe itself! Available in three cover variants!", "title": "IRON MAIDEN LEGACY O/T BEAST VOL 2 NIGHT CITY #2 CVR C TBD", "price": "$3.99", "creators": "(W) Llexi Leon, Ian Edington (A) Kevin West (CA) TBD", "release_date": "2019-07-24", "diamond_id": "MAR191801"}, {"publisher": "AFTERSHOCK COMICS", "description": "The mayhem continues as Jackie finds herself rubbing shoulders with Jonny's high-flying musician friends when she's hired to track down an old blues musician's guitar. From Ollie Masters (The Kitchen, Snow Blind) and Eoin Marron (HER INFERNAL DESCENT, Army of Darkness, James Bond) comes the next rock'n'roll sensation, with a beat that'll kill you dead.", "title": "KILLER GROOVE #3", "price": "$3.99", "creators": "(W) Ollie Masters (A/CA) Eoin Marron", "release_date": "2019-07-24", "diamond_id": "MAY191315"}, {"publisher": "COFFIN COMICS", "description": "The limited \"Raw\" Edition of La Muerta: Retribution #1 highlights the intricate artistry of Richard Ortiz. This is a full-color, collectible 48-page comic book, signed by creator Brian Pulido! Features a premium cardstock cover and is limited to 400 copies! Comes bagged and boarded with a Certificate of Authenticity.", "title": "LA MUERTA RETRIBUTION #1 (OF 2) RAW ED (MR)", "price": "$25.00", "creators": "(W) Mike MacLean (A) Joel Gomez (CA) Richard Ortiz", "release_date": "2019-07-24", "diamond_id": "MAY191606"}, {"publisher": "COFFIN COMICS", "description": "This 25th anniversary edition of the legendary Lady Death: The Reckoning #1 has been intimately re-mastered: re-scanned color pages, lettering restoration, and features a never-before-seen behind the scenes sketchbook section, interviews with Brian Pulido, Steven Hughes, and Jeson Jensen, and little seen art. Learn how a medieval girl named Hope renounced her humanity to save her mother's soul in Hell, only to be transformed by insurmountable circumstances into Lady Death, the diva of death! Signed in silver ink by creator Brian Pulido and colorist Jason Jensen. ", "title": "LADY DEATH THE RECKONING #1 25TH ANNIV SGN LTD ED (MR)", "price": "$25.00", "creators": "(W) Brian Pulido (A/CA) Steven Hughes", "release_date": "2019-07-24", "diamond_id": "APR191621"}, {"publisher": "ONI PRESS INC.", "description": "A new oversized, hardcover edition of the critically-acclaimed and award-winning series about presidency and first contact, packed with extras like creator commentary, sketches, concept art, and more! This third volume collects the interstitial oneshots focusing on the astronauts of the Clarke-why they signed up for a one-way trip, and what they hoped to accomplish on their journey-as well as the mysterious Builders, who are responsible for the End, a powerful force that hurtles toward Earth and its billions of inhabitants. President Stephen Blades struggles with how to tell the people of Earth that most of them won't survive the End. But when he learns that even the 666 humans he hand-picked will fall victim to the End, it seems all hope is lost. The same can be said for the crew of the Clarke, crash-landed on Mars after sabotaging the Builders and their escape ship. Now at the mercy of the Builders, who have followed them to the red planet in order to exact revenge, Charlotte and Overholt do what they can to keep their crew alive-for as long as they can hold out.", "title": "LETTER 44 DLX HC VOL 03 (MR)", "price": "$59.99", "creators": "(W) Charles Soule (A/CA) Alberto Alburquerque", "release_date": "2019-07-24", "diamond_id": "MAR191915"}, {"publisher": "TITAN COMICS", "description": "The official Life is Strange comic series, acclaimed by fans and critics alike! Max's roadtrip through an alternate timeline hits a speedbump - but surely she can handle it, so long as Chloe's happy and Rachel is alive? The second arc continues into its third chapter!", "title": "LIFE IS STRANGE #7 CVR B GAME ART (MR)", "price": "$3.99", "creators": "(W) Emma Vieceli (A) Claudia Leonardi, Andrea Izzo (CA) Game Cover", "release_date": "2019-07-24", "diamond_id": "MAY191961"}, {"publisher": "TITAN COMICS", "description": "The official Life is Strange comic series, acclaimed by fans and critics alike! Max's roadtrip through an alternate timeline hits a speedbump - but surely she can handle it, so long as Chloe's happy and Rachel is alive? The second arc continues into its third chapter!", "title": "LIFE IS STRANGE #7 CVR C TSHIRT (MR)", "price": "$3.99", "creators": "(W) Emma Vieceli (A) Claudia Leonardi, Andrea Izzo", "release_date": "2019-07-24", "diamond_id": "MAY191962"}, {"publisher": "CALIBER ENTERTAINMENT", "description": "A hard-nosed cop in a violent, corrupt metropolis. A stolen samurai sword with mystical properties. A strange green fog enveloping the city. The Mayor, perhaps himself the most corrupt, is ready to do anything to control and channel the city's festering criminality- and, in so doing, assure his re-election. But is Detective Cronenberg, a man torn between duty and justice, willing to let him get away with his horrific plans? Collects comic issues #1-5.", "title": "LIVE DIE RELOAD GN VOL 01", "price": "$12.99", "creators": "(W) Andrea Amenta (A/CA) Stefano Cardoselli", "release_date": "2019-07-24", "diamond_id": "MAY191598"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "Wanted fugitive Livewire reveals that the Psiot Security & Education Program is the evil organization O.M.E.N. to the world! Will Phoebe Daniels choose to defend O.M.E.N. or go with Livewire and fight? Find out in the climatic final issue of Livewire Arc 2: \"Guardian\"!", "title": "LIVEWIRE #8 CVR A ROCAFORT", "price": "$3.99", "creators": "(W) Vita Ayala (A) Kano (CA) Kenneth Rocafort", "release_date": "2019-07-24", "diamond_id": "MAY192022"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "Wanted fugitive Livewire reveals that the Psiot Security & Education Program is the evil organization O.M.E.N. to the world! Will Phoebe Daniels choose to defend O.M.E.N. or go with Livewire and fight? Find out in the climatic final issue of Livewire Arc 2: \"Guardian\"!", "title": "LIVEWIRE #8 CVR B RENAUD", "price": "$3.99", "creators": "(W) Vita Ayala (A) Kano (CA) Paul Renaud", "release_date": "2019-07-24", "diamond_id": "MAY192023"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "Wanted fugitive Livewire reveals that the Psiot Security & Education Program is the evil organization O.M.E.N. to the world! Will Phoebe Daniels choose to defend O.M.E.N. or go with Livewire and fight? Find out in the climatic final issue of Livewire Arc 2: \"Guardian\"!", "title": "LIVEWIRE #8 CVR C RAHZZAH", "price": "$3.99", "creators": "(W) Vita Ayala (A) Kano (CA) Rahzzah", "release_date": "2019-07-24", "diamond_id": "MAY192024"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "", "title": "LIVEWIRE #8 CVR D PRE-ORDER BUNDLE ED", "price": "$3.99", "creators": "(W) Vita Ayala (A) Kano (CA) Khary Randolph", "release_date": "2019-07-24", "diamond_id": "MAY198004"}, {"publisher": "GRAPHIX", "description": "Almost everything is going great for Dany. She and Madison are still best friends, she still has her magic sketchbook, and the new school year is looking up. But when Dany creates a duplicate of herself to secretly help with homework and raise her social status, the two of them accidentally unleash a magical dog that wreaks supernatural havoc on the town. Now, with the big school dance coming up, time is running short for Dany, Madison, and their friends to set things right before the night is completely ruined! Available in softcover and hardcover editions.", "title": "MAKING FRIENDS GN VOL 02 BACK TO DRAWING BOARD", "price": "$12.99", "creators": "(W) Kristen Gudsnuk (A/CA) Kristen Gudsnuk", "release_date": "2019-07-24", "diamond_id": "MAY191733"}, {"publisher": "GRAPHIX", "description": "Dany, Madison, and...wait-another Dany?!-must navigate some very complicated friendships while trying to capture a magical dog that is turning their town upside-down! Almost everything is going great for Dany. She and Madison are still best friends, she still has her magic sketchbook, and the new school year is looking up. But when Dany creates a duplicate of herself to secretly help with homework and raise her social status, the two of them accidentally unleash a magical dog that wreaks supernatural havoc on the town. Now, with the big school dance coming up, time is running short for Dany, Madison, and their friends to set things right before the night is completely ruined!", "title": "MAKING FRIENDS HC GN VOL 02 BACK TO DRAWING BOARD", "price": "$24.99", "creators": "(W) Kristen Gudsnuk (A/CA) Kristen Gudsnuk", "release_date": "2019-07-24", "diamond_id": "MAY191734"}, {"publisher": "AMERICAN GOTHIC PRESS", "description": "Private detective Hank Barrymore stumbled upon the occult when he investigated a murder case on the World Studios movie set. Now, in his quest to find the witch he fell reluctantly in love with, Hank enlists the help of Nybbas, the demon of knowledge, and follows his clues to the plains of Oklahoma, where a strange farm boy is planting fear into the hearts of monsters and townspeople alike! ", "title": "MONSTER WORLD GOLDEN AGE #1 (OF 6) CVR A KOWALSKI", "price": "$3.99", "creators": "(W) Philip Kim, Holly Interlandi (A/CA) Piotr Kowalski", "release_date": "2019-07-24", "diamond_id": "MAY191341"}, {"publisher": "AMERICAN GOTHIC PRESS", "description": "Private detective Hank Barrymore stumbled upon the occult when he investigated a murder case on the World Studios movie set. Now, in his quest to find the witch he fell reluctantly in love with, Hank enlists the help of Nybbas, the demon of knowledge, and follows his clues to the plains of Oklahoma, where a strange farm boy is planting fear into the hearts of monsters and townspeople alike! ", "title": "MONSTER WORLD GOLDEN AGE #1 (OF 6) CVR B NAT JONES", "price": "$3.99", "creators": "(W) Philip Kim, Holly Interlandi (A) Piotr Kowalski (CA) Nat Jones", "release_date": "2019-07-24", "diamond_id": "MAY191342"}, {"publisher": "ZENESCOPE ENTERTAINMENT INC", "description": "Dorothy and friends free Glinda and Adraste, but something-- make that a lot of somethings-- would see them all dead. Is it too late for the world of Oz anyway? Back in the Emerald City, the Heart of Oz is finally unearthed-- and nobody was expecting what they found. And the truth about the Wizard is revealed, as his power grows even more dangerous!", "title": "OZ HEART OF MAGIC #4 (OF 5) CVR A VIGONTE", "price": "$3.99", "creators": "(W) Terry Kavanagh (A) Marcelo Mueller (CA) Geebo Vigonte", "release_date": "2019-07-24", "diamond_id": "MAY192069"}, {"publisher": "ZENESCOPE ENTERTAINMENT INC", "description": "Dorothy and friends free Glinda and Adraste, but something-- make that a lot of somethings-- would see them all dead. Is it too late for the world of Oz anyway? Back in the Emerald City, the Heart of Oz is finally unearthed-- and nobody was expecting what they found. And the truth about the Wizard is revealed, as his power grows even more dangerous!", "title": "OZ HEART OF MAGIC #4 (OF 5) CVR B VITORINO", "price": "$3.99", "creators": "(W) Terry Kavanagh (A) Marcelo Mueller (CA) Igor Vitorino", "release_date": "2019-07-24", "diamond_id": "MAY192070"}, {"publisher": "ZENESCOPE ENTERTAINMENT INC", "description": "Dorothy and friends free Glinda and Adraste, but something-- make that a lot of somethings-- would see them all dead. Is it too late for the world of Oz anyway? Back in the Emerald City, the Heart of Oz is finally unearthed-- and nobody was expecting what they found. And the truth about the Wizard is revealed, as his power grows even more dangerous!", "title": "OZ HEART OF MAGIC #4 (OF 5) CVR C SPAY", "price": "$3.99", "creators": "(W) Terry Kavanagh (A) Marcelo Mueller (CA) Anthony Spay", "release_date": "2019-07-24", "diamond_id": "MAY192071"}, {"publisher": "ZENESCOPE ENTERTAINMENT INC", "description": "Dorothy and friends free Glinda and Adraste, but something-- make that a lot of somethings-- would see them all dead. Is it too late for the world of Oz anyway? Back in the Emerald City, the Heart of Oz is finally unearthed-- and nobody was expecting what they found. And the truth about the Wizard is revealed, as his power grows even more dangerous!", "title": "OZ HEART OF MAGIC #4 (OF 5) CVR D COCCOLO", "price": "$3.99", "creators": "(W) Terry Kavanagh (A) Marcelo Mueller (CA) Martin Coccolo", "release_date": "2019-07-24", "diamond_id": "MAY192072"}, {"publisher": "AHOY COMICS", "description": "Feeling like misfits in 2019, the thawed-out jocks from the '80s hatch a plan for revenge on the rich and powerful nerd who froze them. PLUS! As the 21st century dawns, Jenny considers moving to the big city to write for one of those new-fangled \"blogs.\" Will her mom approve? EXTRA! AHOY's familiar assortment of text and illustrations.", "title": "PLANET OF THE NERDS #4 (MR)", "price": "$3.99", "creators": "(W) Paul Constant (A) Randy Elliott (A/CA) Alan Robinson", "release_date": "2019-07-24", "diamond_id": "MAY191322"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "After an explosive escape from a cosmic prison, the team of amnesiac astronauts need to find a way home! But where is the ship that brought them here in the first place? And just who are these Psi-Lords they keep hearing about?  It's a deadly scavenger hunt around the Gyre in search of a way back home, but this cosmic ring of decaying ships hides many threats within its aging walls!", "title": "PSI-LORDS #2 CVR A NAKAYAMA", "price": "$3.99", "creators": "(W) Fred Van Lente (A) Renato Guedes (CA) David Nakayama", "release_date": "2019-07-24", "diamond_id": "MAY192013"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "After an explosive escape from a cosmic prison, the team of amnesiac astronauts need to find a way home! But where is the ship that brought them here in the first place? And just who are these Psi-Lords they keep hearing about?  It's a deadly scavenger hunt around the Gyre in search of a way back home, but this cosmic ring of decaying ships hides many threats within its aging walls!", "title": "PSI-LORDS #2 CVR B WIJNGAARD", "price": "$3.99", "creators": "(W) Fred Van Lente (A) Renato Guedes (CA) Caspar Wijngaard", "release_date": "2019-07-24", "diamond_id": "MAY192014"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "After an explosive escape from a cosmic prison, the team of amnesiac astronauts need to find a way home! But where is the ship that brought them here in the first place? And just who are these Psi-Lords they keep hearing about?  It's a deadly scavenger hunt around the Gyre in search of a way back home, but this cosmic ring of decaying ships hides many threats within its aging walls!", "title": "PSI-LORDS #2 CVR C HANS", "price": "$3.99", "creators": "(W) Fred Van Lente (A) Renato Guedes (CA) Stephanie Hans", "release_date": "2019-07-24", "diamond_id": "MAY192015"}, {"publisher": "VALIANT ENTERTAINMENT LLC", "description": "", "title": "PSI-LORDS #2 CVR D PRE-ORDER BUNDLE ED", "price": "$3.99", "creators": "(W) Fred Van Lente (A) Renato Guedes (CA) Paulina Ganecheau", "release_date": "2019-07-24", "diamond_id": "MAY198005"}, {"publisher": "VIZ MEDIA LLC", "description": "As spectral Nemeses start to appear all over Cyfandir, Seth is drawn into a nefarious plot against his will. Suspicion stalks the very halls of the Wizard Knights' castle, and the Merchant Barons watch with pleasure as these supernatural events unfold. And it's only a matter of time before Captain Dragunov and Captain Liselotte get their hands on Seth! For teen audiences. ", "title": "RADIANT GN VOL 06", "price": "$9.99", "creators": "(W) Tony Valente (A/CA) Tony Valente", "release_date": "2019-07-24", "diamond_id": "MAY192159"}, {"publisher": "DISNEY - HYPERION", "description": "Book two in the bestselling Descendants series, now in the wickedly fun, action-packed graphic novel! Mal's an expert at intimidating her enemies, but she's broken the habit since leaving her villainous roots behind. So when she and her friends Evie, Carlos, and Jay all receive threatening messages demanding they return home, Mal can't believe it. And when Evie looks into her Magic Mirror, what she sees only confirms their fears. Maleficent's just a tiny lizard after her run-in with Mal at Ben's Coronation, but she's the worst villain in the land for a reason. Could she have found a way to escape? Whatever's going on, Mal, Evie, Carlos, and Jay know they have to sneak back to the Isle and get to the bottom of it. Without its infamous leader, the island's even worse than when they left it, but the comforts of home can be hard to resist for recently reformed villains. Available in softcover and hardcover editions.", "title": "RETURN TO ISLE OF THE LOST GN", "price": "$12.99", "creators": "(W) Melissa De La Cruz, Robert Venditti (A) Kat Fajardo", "release_date": "2019-07-24", "diamond_id": "MAY191621"}, {"publisher": "DISNEY - HYPERION", "description": ":Book two in the #1 New York Times best-selling Descendants series--now in the wickedly fun, action-packed graphic novel!Mal's an expert at intimidating her enemies, but she's broken the habit since leaving her villainous roots behind. So when she and her friends Evie, Carlos, and Jay all receive threatening messages demanding they return home, Mal can't believe it. Sure, she's King Ben's girlfriend now, and she's usually nice to her classmates, but she still didn't think anyone would be silly enough to try to push her around. The thing is, it kind of worked. Especially since she and her friends have a sneaking suspicion that their villainous parents are behind the messages. And when Evie looks into her Magic Mirror, what she sees only confirms their fears. Maleficent's just a tiny lizard after her run-in with Mal at Ben's Coronation, but she's the worst villain in the land for a reason. Could she have found a way to escape? Whatever's going on, Mal, Evie, Carlos, and Jay know they have to sneak back to the Isle and get to the bottom of it. Without its infamous leader, the island's even worse than when they left it, but the comforts of home-even a home as gloomy as the Isle of the Lost-can be hard to resist for recently reformed villains. Will the kids be able to beat the evil bubbling at the Isle's wicked core, or will the plot to destroy Auradon succeed?", "title": "RETURN TO ISLE OF THE LOST HC GN", "price": "$21.99", "creators": "(W) Melissa De La Cruz, Robert Venditti (A) Kat Fajardo", "release_date": "2019-07-24", "diamond_id": "MAY191622"}, {"publisher": "SCOUT COMICS", "description": "A cross between Calvin and Hobbes and the Lord of the Rings, Sabretooth Dan is a sword and sorcery tale for all-ages. Dan is an orphan with both Sabretooth teeth and an over-active imagination in the 13 Kingdoms, a Lord of the Rings-like world full of talking animals, pirates, and mystery. But when real-world adventure comes knocking, Dan finds it impossible to say no. With lavish artwork in full color for the first time by Gunnar Bergstorm, a professional animator. Collecting the three issue series, plus bonus features.", "title": "SABRETOOTH DAN TP VOL 01 (RES)", "price": "$12.99", "creators": "(W) C.R. Mountain (A/CA) C.R. Mountain", "release_date": "2019-07-24", "diamond_id": "APR191928"}, {"publisher": "YEN PRESS", "description": "The Grand Consecration to celebrate the founding of the Kingdom of Ozmargo is nigh...but the king of beasts remains in his human form despite the dawn! Thanks to Sariphi's quick thinking, disaster is averted and the ceremony goes off without a hitch, prompting Chancellor Anubis to declare an end to Sariphi's trials. But having assumed the role of Acting Queen, Sariphi is faced with her first job...which just might turn out to be insurmountable! For Ages 13 And Up", "title": "SACRIFICIAL PRINCESS & KING BEASTS GN VOL 06", "price": "$13.00", "creators": "(W) Yu Tomofuji (A/CA) Yu Tomofuji", "release_date": "2019-07-24", "diamond_id": "MAY192201"}, {"publisher": "ONI PRESS INC.", "description": "The New York Times bestselling series and basis for the movie Scott Pilgrim vs. The World is now available in a new full-color softcover format! This volume collects 2 volumes of the award-winning series (one of three massive books in this edition.) Laugh as slacker Scott Pilgrim tries and sometimes fails to get his life together and win the heart of the literal girl of his dreams, Ramona Flowers! Cry when things look bleak for our heroes! Make a confused face at the countless Canadian references! (Unless you live in Canada already.) The perfect gift for a Scottoholic-or for anyone discovering the bestselling series for the first time.", "title": "SCOTT PILGRIM COLOR COLLECTION TP VOL 01", "price": "$29.99", "creators": "(W) Bryan Lee O'Malley (A/CA) Bryan Lee O'Malley", "release_date": "2019-07-24", "diamond_id": "DEC181979"}, {"publisher": "ONI PRESS INC.", "description": "The New York Times bestselling series and basis for the movie Scott Pilgrim vs. The World is now available in a new full-color softcover format! This volume collects 2 volumes of the award-winning series (one of three massive books in this edition.) Laugh as slacker Scott Pilgrim tries and sometimes fails to get his life together and win the heart of the literal girl of his dreams, Ramona Flowers! Cry when things look bleak for our heroes! Make a confused face at the countless Canadian references! (Unless you live in Canada already.) The perfect gift for a Scottoholic-or for anyone discovering the bestselling series for the first time.", "title": "SCOTT PILGRIM COLOR COLLECTION TP VOL 02", "price": "$29.99", "creators": "(W) Bryan Lee O'Malley (A/CA) Bryan Lee O'Malley", "release_date": "2019-07-24", "diamond_id": "DEC181980"}, {"publisher": "ONI PRESS INC.", "description": "The New York Times bestselling series and basis for the movie Scott Pilgrim vs. The World is now available in a new full-color softcover format! This volume collects 2 volumes of the award-winning series (one of three massive books in this edition.) Laugh as slacker Scott Pilgrim tries and sometimes fails to get his life together and win the heart of the literal girl of his dreams, Ramona Flowers! Cry when things look bleak for our heroes! Make a confused face at the countless Canadian references! (Unless you live in Canada already.) The perfect gift for a Scottoholic-or for anyone discovering the bestselling series for the first time.", "title": "SCOTT PILGRIM COLOR COLLECTION TP VOL 03", "price": "$29.99", "creators": "(W) Bryan Lee O'Malley (A/CA) Bryan Lee O'Malley", "release_date": "2019-07-24", "diamond_id": "DEC181981"}, {"publisher": "YEN PRESS", "description": "Deep struggles and concerns about sex are stripped bare in this shocking confession! Married life isn't all lovey-dovey, or ooh-la-la steamy--not when you and your partner have opposing sex drives. When a married woman with a raging libido can't find the satisfaction she needs from her tame, lackluster husband, she's left with no choice but to get her fix elsewhere... For Ages 16 And Up", "title": "SECRETLY IVE BEEN SUFFERING ABOUT BEING SEXLESS GN", "price": "$15.00", "creators": "(W) Togame (A/CA) Togame", "release_date": "2019-07-24", "diamond_id": "MAY192185"}, {"publisher": "CALIBER ENTERTAINMENT", "description": "Seeker is an operative for a special task force unit called the Seeker Project. Over the years the Seeker persona has become a popular icon for the public. Secretly, she is LeAnn Haywood, a woman who wears the mantle of Seeker for she understands that she is Seeker and Seeker is her. But she's wrong. Before her, there was another Seeker, and before that, yet another. Now, a former Seeker, Tracy LeMaster, has escaped from a mental facility with a pledge to reclaim the mantle of Seeker. But there's only way to do that, she has to kill Seeker.", "title": "SEEKER IDENTITY CRISIS VOL 01", "price": "$14.99", "creators": "(W) Gary Reed (A) Chris Massarotto, Tim Smith, Adam Walters, Bruce McCorkindale, Ted Pertzborn, Joey Robinson, Larry Shuput, Sam Varney (CA) Mariusz Zabdyr", "release_date": "2019-07-24", "diamond_id": "MAY191599"}, {"publisher": "NOBROW", "description": "In this epic tale of friendship, compassion, and growth, Molly Mendoza's stunning art and gripping storytelling immerses you in alternate world filled with mystical creatures and dazzling landscapes. When Bloom is thrown from their world, and Gloopy is exiled from their own, the two youngsters find in each other a much-needed kindred spirit. But as they skip through dimensions and encounter weeping giants, alligator islands and topsy-turvy 2D worlds, they find that their greatest challenge will be facing their own fears back home.", "title": "SKIP GN", "price": "$22.95", "creators": "(W) Molly Mendoza (A) Molly Mendoza", "release_date": "2019-07-24", "diamond_id": "MAY191834"}, {"publisher": "YEN PRESS", "description": "Honda might be a skeleton, but that's nowhere near as crazy as working in a Japanese bookstore! Whether it's running the store, dealing with out-of-print books, or handling eccentric customers, the bookstore life is filled with laughter and tears. For Ages 16 And Up", "title": "SKULL-FACE BOOKSELLER HONDA-SAN GN VOL 01", "price": "$15.00", "creators": "(W) Honda (A/CA) Honda", "release_date": "2019-07-24", "diamond_id": "MAY192186"}, {"publisher": "ASPEN MLT INC", "description": "Soulfire is back with its biggest story-and greatest challenge to its heroes ever! Grace is determined to protect magic in all its forms from a world still locked in their technological ways, but she is not outwardly looking for a fight. Minerva, on the other hand, has amassed a strike force from around the globe and is ready to face this strange new danger. And now, she has a target--Rainier's realm at Devil's Tower! Veteran Soulfire scribe J.T. Krul (Soulfire, Jirni) returns and teams up with rising star Raffaele Fort&#233; and colorist Valentina Taddeo (Aspen Visions: Soulfire) in this magical world-shattering new volume that will change the face of everything you know about the Soulfire Universe!", "title": "SOULFIRE VOL 8 #2 CVR A FORTE", "price": "$3.99", "creators": "(W) J. T. Krul (A/CA) Raffaele Forte", "release_date": "2019-07-24", "diamond_id": "MAY191442"}, {"publisher": "ASPEN MLT INC", "description": "Soulfire is back with its biggest story-and greatest challenge to its heroes ever! Grace is determined to protect magic in all its forms from a world still locked in their technological ways, but she is not outwardly looking for a fight. Minerva, on the other hand, has amassed a strike force from around the globe and is ready to face this strange new danger. And now, she has a target--Rainier's realm at Devil's Tower! Veteran Soulfire scribe J.T. Krul (Soulfire, Jirni) returns and teams up with rising star Raffaele Fort&#233; and colorist Valentina Taddeo (Aspen Visions: Soulfire) in this magical world-shattering new volume that will change the face of everything you know about the Soulfire Universe!", "title": "SOULFIRE VOL 8 #2 CVR B TURNER", "price": "$3.99", "creators": "(W) J. T. Krul (A) Raffaele Forte (CA) Michael Turner", "release_date": "2019-07-24", "diamond_id": "MAY191443"}, {"publisher": "AMERICAN MYTHOLOGY PRODUCTIONS", "description": "Previously available only at the Stargate booth at the 2018 New York Comic Con! This exclusive fan edition is highly limited and the only version of the sold-out SGU Volume 1 TP still available! Limited to 400 copies.", "title": "STARGATE UNIVERSE TP VOL 01 LTD ED PHOTO CVR", "price": "$24.99", "creators": "(W) Mark L. Haynes, J. C. Vaughn (A) Giancarlo Caracuzzo, Eliseu Zeu Gouveia, Clint Hilinski (CA) Photo", "release_date": "2019-07-24", "diamond_id": "FEB191383"}, {"publisher": "YEN PRESS", "description": "Mariela is the last alchemist alive after waking from a deep sleep that lasted two hundred years. As the sole alchemist in town, she can make a killing from making and selling potions...but after two hundred years of suspended animation, all she wants to do is relax, take things easy, and live at her own pace! For Ages 13 And Up", "title": "SURVIVED ALCHEMIST DREAM QUIET TOWN LIFE GN VOL 01", "price": "$13.00", "creators": "(W) Guru Mizoguchi (A/CA) Usata Nonohara", "release_date": "2019-07-24", "diamond_id": "MAY192187"}, {"publisher": "TITAN COMICS", "description": "Tank Girl Forever (1 of 4). The world calls out for a true superhero! Unfortunately, it got the wrong number, and Tank Girl answered! The second story in Tank Girl's ongoing series begins, as original creator Alan Martin and fan-favorite artist Brett Parson unleash fast-paced and foul-mouthed hilarity! An all-new story exploring the weirdest corners of Tank Girl's world!", "title": "TANK GIRL #5 CVR A PARSON", "price": "$3.99", "creators": "(W) Alan Martin (A/CA) Brett Parson", "release_date": "2019-07-24", "diamond_id": "MAY191939"}, {"publisher": "TITAN COMICS", "description": "Tank Girl Forever (1 of 4). The world calls out for a true superhero! Unfortunately, it got the wrong number, and Tank Girl answered! The second story in Tank Girl's ongoing series begins, as original creator Alan Martin and fan-favorite artist Brett Parson unleash fast-paced and foul-mouthed hilarity! An all-new story exploring the weirdest corners of Tank Girl's world!", "title": "TANK GIRL #5 CVR B PANOSIAN", "price": "$3.99", "creators": "(W) Alan Martin (A) Brett Parson (CA) Dan Panosian", "release_date": "2019-07-24", "diamond_id": "MAY191940"}, {"publisher": "TITAN COMICS", "description": "Tank Girl Forever (1 of 4). The world calls out for a true superhero! Unfortunately, it got the wrong number, and Tank Girl answered! The second story in Tank Girl's ongoing series begins, as original creator Alan Martin and fan-favorite artist Brett Parson unleash fast-paced and foul-mouthed hilarity! An all-new story exploring the weirdest corners of Tank Girl's world!", "title": "TANK GIRL #5 CVR C KANE", "price": "$3.99", "creators": "(W) Alan Martin (A) Brett Parson (CA) Shaky Kane", "release_date": "2019-07-24", "diamond_id": "MAY191941"}, {"publisher": "BROADSWORD COMICS", "description": "This limited, numbered, and signed studio edition of Tarot #110 features a limited edition wraparound cover that features Raven Hex. This edition will be bagged and boarded with a full color Skyclad version of Raven Hex from Cover A art print, for grown ups only!", "title": "TAROT WITCH OF THE BLACK ROSE #110 STUDIO DELUXE ED (MR)", "price": "$19.99", "creators": "(W) Jim Balent (A/CA) Jim Balent", "release_date": "2019-07-24", "diamond_id": "APR191599"}, {"publisher": "NETCOMICS", "description": "Forsaken and miserable, Kassan agrees to assist Caesar, even though such a decision might be his downfall. King Asakin is summoned to the palace by his Queen Mother, whose ploy is to arrange a convenient marriage for him. Nonetheless, the King's plans are different, and he asks for Igen's help in political matters. Betrayed by someone he cared for, Kassan will likely face a cruel fate.", "title": "TO TAKE AN ENEMYS HEART GN VOL 05 (MR)", "price": "$12.99", "creators": "(W) Yusa (A/CA) Yusa", "release_date": "2019-07-24", "diamond_id": "APR192304"}, {"publisher": "NETCOMICS", "description": "Igen is over the moon now that his love is out in the open. However, his happiness will not last long, as new enemies arrive at his residence. Their hidden agendas might have devastating consequences. Asakin is showing signs of finally becoming the king Caesar trained him to be. Still, this change leaves Caesar with the feeling that he might not be useful anymore.", "title": "TO TAKE AN ENEMYS HEART GN VOL 06 (MR)", "price": "$12.99", "creators": "(W) Yusa (A/CA) Yusa", "release_date": "2019-07-24", "diamond_id": "APR192305"}, {"publisher": "FANTAGRAPHICS BOOKS", "description": "Hot on the heels of Jaime Hernandez's masterpiece, Is This How You See Me?, comes a stand-alone graphic novel that focuses on one of Hernandez's most memorable characters, Tonta, while she confronts her family history. Her half-sister Vivian gets involved with a small-town gangster while Tonta befriends a young woman who keeps tabs on the neighborhood from the surrounding woods. Meanwhile, back at school, Tonta discovers that Coach Angel harbors a secret while local punk band Ooot provides the soundtrack.", "title": "TONTA HC LOVE & ROCKETS (MR)", "price": "$19.99", "creators": "(W) Jaime Hernandez (A/CA) Jaime Hernandez", "release_date": "2019-07-24", "diamond_id": "MAY191681"}, {"publisher": "YEN PRESS", "description": "Kaito has had a rough life, but it only gets worse after he dies. When he's summoned to another world, he meets a beautiful and terrifying girl who offers him a choice-to be her servant and help her slay demons, or to suffer at her hands! ", "title": "TORTURE PRINCESS FREMD TORTURCHEN COMPLETE MANGA OMNIBUS (MR", "price": "$30.00", "creators": "(W) Keishi Ayasato (A/CA) Hina Yamato", "release_date": "2019-07-24", "diamond_id": "MAY192188"}, {"publisher": "ANTARCTIC PRESS", "description": "Nothing about Donarudo passes the eyeball test when it comes to politicians, from his uneven tan to his bald-er, unusual hairstyle to his unimpressive physique.However, whatever else he lacks, he's got it big when it comes to problems: He just can't seem to find an opponent strong enough to take on!He's so powerful that he can defeat any opposition with one Tweet!Will he find someone who can go toe-to-toe with him and give his career some meaning?", "title": "TRUMP PUNCH MAN DELETE THIS ONE-SHOT", "price": "$4.99", "creators": "(W) Wan (A) Wan (CA) Timonthy Lim", "release_date": "2019-07-24", "diamond_id": "SEP181471"}, {"publisher": "AFTERSHOCK COMICS", "description": "Carnahan-or what now looks out from behind his eyes-finally tells Shaw the truth about what's in store for humanity. As the world begins its transformation according to the villain's grand design, Shaw realizes she has only one card left to play-one that will almost certainly mean her own destruction. The next chapter in a new kind of horror story for modern America, written by Garth Ennis (Preacher, The Boys, The Punisher) and drawn by Goran Sud uka (Y: The Last Man, Hellblazer).", "title": "WALK THROUGH HELL #12 (MR)", "price": "$3.99", "creators": "(W) Garth Ennis (A/CA) Goran Sudzuka", "release_date": "2019-07-24", "diamond_id": "MAY191311"}, {"publisher": "YEN PRESS", "description": "As corporate slave Routa Okami keels over in the middle of his busy office, he imagines about how nice it would have been to live as the pet of some of rich family instead of literally working himself to death. When a goddess actually grants that wish and brings him back as a pampered pooch, Routa is over the moon! ...But wait, why is he howling at it...? For Ages 13 And Up", "title": "WOOF WOOF STORY GN VOL 01 PAMPERED POOCH NOT FENRIR", "price": "$13.00", "creators": "(W) Inumajin (A/CA) Kiki Koikuchi", "release_date": "2019-07-24", "diamond_id": "MAY192189"}, {"publisher": "GHOST SHIP", "description": "20-year-old virgin Nishizuru Yatsuki has always considered himself a fairly normal guy-he's a high school graduate, works a part-time job, and hangs out at a maid cafe. He does have one very special ability: he can see yokai spirits! Usually he copes with these ghostly visions by ignoring them-but everything changes when he meets a beautiful young woman named Rokka. Now Yatsuki's normal days have taken a notably abnormal turn, as he finds himself the sole defender of a growing harem of supernatural-and super sexy-yokai girls! For audiences for ages 16+ years old.", "title": "YOKAI GIRLS GN VOL 08 (MR)", "price": "$12.99", "creators": "", "release_date": "2019-07-24", "diamond_id": "MAY192089"}, {"publisher": "JY", "description": "Everyone's favorite zombie kid is back with more surprises! So keep your eyes peeled and socks on, because an adventure with Zombie Boy isn't one you'd want to miss! For Ages 10 And Up", "title": "ZO ZO ZOMBIE GN VOL 04", "price": "$12.00", "creators": "(W) Yasunari Nagatoshi (A/CA) Yasunari Nagatoshi", "release_date": "2019-07-24", "diamond_id": "MAY192209"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "In Norway, the forces chasing Angel collide as her powers continue to be her biggest asset, but also her greatest danger. With everyone wanting a piece of her newfound abilities, she must decide not only her next step but possibly her fate altogether as the Necrophilia Club makes their true intentions known!", "title": "ZOMBIE TRAMP ONGOING #62 CVR A MACCAGNI (MR)", "price": "$4.99", "creators": "(W) Dan Mendoza, Vince Hernandez (A/CA) Marco Maccagni", "release_date": "2019-07-24", "diamond_id": "MAY191293"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "In Norway, the forces chasing Angel collide as her powers continue to be her biggest asset, but also her greatest danger. With everyone wanting a piece of her newfound abilities, she must decide not only her next step but possibly her fate altogether--as the Necrophilia Club makes their true intentions known!", "title": "ZOMBIE TRAMP ONGOING #62 CVR B MACCAGNI RISQUE (MR)", "price": "$4.99", "creators": "(W) Dan Mendoza, Vince Hernandez (A/CA) Marco Maccagni", "release_date": "2019-07-24", "diamond_id": "MAY191301"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "In Norway, the forces chasing Angel collide as her powers continue to be her biggest asset, but also her greatest danger. With everyone wanting a piece of her newfound abilities, she must decide not only her next step but possibly her fate altogether--as the Necrophilia Club makes their true intentions known!", "title": "ZOMBIE TRAMP ONGOING #62 CVR C GARCIA VAR (MR)", "price": "$4.99", "creators": "(W) Dan Mendoza, Vince Hernandez (A) Marco Maccagni (CA) Richard Garcia", "release_date": "2019-07-24", "diamond_id": "MAY191302"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "In Norway, the forces chasing Angel collide as her powers continue to be her biggest asset, but also her greatest danger. With everyone wanting a piece of her newfound abilities, she must decide not only her next step but possibly her fate altogether--as the Necrophilia Club makes their true intentions known!", "title": "ZOMBIE TRAMP ONGOING #62 CVR D GARCIA RISQUE LTD ED (MR)", "price": "$4.99", "creators": "(W) Vince Hernandez, Dan Mendoza (A) Marco Maccagni (CA) Richard Garcia", "release_date": "2019-07-24", "diamond_id": "MAY191303"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "In Norway, the forces chasing Angel collide as her powers continue to be her biggest asset, but also her greatest danger. With everyone wanting a piece of her newfound abilities, she must decide not only her next step but possibly her fate altogether--as the Necrophilia Club makes their true intentions known!", "title": "ZOMBIE TRAMP ONGOING #62 CVR E HARRIGAN LTD ED (MR)", "price": "$4.99", "creators": "(W) Dan Mendoza, Vince Hernandez (A) Marco Maccagni (CA) David Harrigan", "release_date": "2019-07-24", "diamond_id": "MAY191304"}, {"publisher": "ACTION LAB - DANGER ZONE", "description": "In Norway, the forces chasing Angel collide as her powers continue to be her biggest asset, but also her greatest danger. With everyone wanting a piece of her newfound abilities, she must decide not only her next step but possibly her fate altogether--as the Necrophilia Club makes their true intentions known!", "title": "ZOMBIE TRAMP ONGOING #62 CVR F HARRIGAN RISQUE LTD ED (MR)", "price": "$4.99", "creators": "(W) Dan Mendoza, Vince Hernandez (CA) David Harrigan, Marco Maccagni", "release_date": "2019-07-24", "diamond_id": "MAY191305"}]}